[
    {
        "b_name": "JOOLA Quattro Carbon",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-quattro-carbon",
        "b_speed": 113,
        "b_control": 48,
        "b_weight": "83",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-quattro-carbon.jpg?8",
        "b_description_1": "The JOOLA Quattro Carbon is the innovative result of two specially chosen components: wood veneers and carbon fibers. Five selected wood veneers harmonize perfectly with 4 UD carbon fibers and produce impressive playing characteristics. The 4 UD carbon fibers are parallel to each other not interwoven. This gives the JOOLA Quattro Carbon the highest tempo and direct gameplay, ideal for a risk-oriented offensive game. The UD carbon fibers give a uniform, controlled ball jump and added stability. The core of the fast JOOLA Quattro Carbon is the soft Samba veneer. This gives the wood, together with the very light and also soft Balsa layers, which lie on the inner UD fibers, a more even ball stop and a lot of control. This hybrid combination of hard synthetic fibers and soft wood veneers make the Quattro Carbon the perfect choice for players looking for maximum speed and stability coupled with a good level of control.",
        "b_description_2": "• Very offensive 5+4 ply blade\n• UD carbon fibers provide uniform, controlled ball jump and added stability\n• Suitable for the modern offensive player who plays with great speed",
        "b_description_3": "Veneer: 5+4\nSpeed: 113 (EXTREME)\nControl: 48\nPlaystyle: Offensive – Offensive Extreme\nTechnology: UDC\nWeight: 83g"
    },
    {
        "b_name": "JOOLA Energon Super PBO-c",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-energon-s-pro-c",
        "b_speed": 110,
        "b_control": 50,
        "b_weight": "93",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-energon-s-pro-c.jpg?8",
        "b_description_1": "The JOOLA Energon Super PBO-c blade is the result of the most recent technical developments in the manufacturing of blades.",
        "b_description_2": "The extraordinary light Super PBO-Texture (p-phenylene—benzobisoxazole) is closely interwoven with 1K-carbon fiber threads in a criss-cross pattern and lies directly under the thin outer veneer. As a result of this, the sweet spot is enlarged, which enables an even ball ejection almost right up to the edge of the racket face.",
        "b_description_3": "In addition to a very high playing feel and a medium-hard impact, this gives the blade an incomparable dynamic explosiveness while still keeping a feeling of control. The JOOLA Energon Super PBO-c is astonishingly mistake-forgiving, despite the high speed attributes."
    },
    {
        "b_name": "JOOLA Nobilis PBO-c",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-nobilis",
        "b_speed": 108,
        "b_control": 52,
        "b_weight": "87",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-nobilis.jpg?8",
        "b_description_1": "The layered structure of the single veneers is what makes the JOOLA Nobilis Blade special. The PBO-c fibers are placed directly on top of the Kiri core veneer. In addition to a good playing feel, the 1.2mm hard Hinoki outer veneers give the blade a prolonged ball contact time and allow for the most extreme spin on a ball, creating a high trajectory. This construction gives the blade stability, elasticity and a lot of force, enabling very precise play even at high speed. The interaction of the individual components makes the JOOLA Nobilis PBO an offensive blade that is more than just fast and balanced with good spin and precise, pure feeling. The JOOLA Nobilis PBO-c is in its own class!",
        "b_description_2": "• Very offensive 3+2 ply blade\n• PBO-c fibers provides an enlarged sweet spot and improved acceleration\n• Suitable for the modern offensive player who plays with great speed\n• Developed for the ABS Ball",
        "b_description_3": "Vibration: Medium\nTouch: Hard\nPly: 3+2\nComposition: Hinoki, PBO-c, Kiri\nPlaystyle: Off- / Off+\nTechnology: PBO-c Carbon\nHead Size: 157mm x 151mm\nThickness: 7.1mm"
    },
    {
        "b_name": "JOOLA ZeLeBRO PBO-c",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-zelebro",
        "b_speed": 105,
        "b_control": 55,
        "b_weight": "90",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-zelebro.jpg?8",
        "b_description_1": "The new JOOLA Zelebro PBO-c is an absolute top-class blade; only the best materials are used. This 7-ply offensive blade generates explosive and direct power without losing control. The focus of the JOOLA Zelebro PBO-c is the synthetic PBO poly fibers which are plain woven with the carbon fibers and are positioned directly under the upper Limba veneer. This combination produces an enlarged sweet spot, a lot of repulsion, and a medium-high trajectory due to the ratio of natural woods and PBO carbon fibers. The vibration dampening effect of the PBO-c is ideal for all players that prefer direct offense and precise strokes. This blade is an asset to every offensive player in any playing situation!",
        "b_description_2": "• Very offensive 5+2 ply blade\n• PBO-c fibers provides and enlarged sweet spot and improved acceleration\n• Suitable for the modern offensive player who plays close to mid-distance from the table\n• Developed for the ABS Ball",
        "b_description_3": "Vibration: low\nTouch: Hard\nPly: 7\nComposition: Limba, PBO-C, Koto, Kiri\nPlaystyle: Off- / Off+\nTechnology: PBO-c Carbon\nHead Size: 157mm x 151mm\nThickness: 5.7mm"
    },
    {
        "b_name": "JOOLA TPE Perform",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-tpe-perform",
        "b_speed": 103,
        "b_control": 73,
        "b_weight": "87",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-tpe-perform.jpg?8",
        "b_description_1": "The selected Hinoki top layer is specially heated to remove all moisture to create a warp-resistant blade. The specially treated Hinoki top layer guarantees high control and allows the user to produce the fastest shots. The built-in carbon fibers not only enlarge the sweet spot, but also help produce a higher, more spin-orientated ball flight.",
        "b_description_2": "• Very offensive 5+2 ply blade\n• Heat treated Hinoki guarantees a warp free blade\n• Suitable for aggressive close/mid distance play\n• Developed from the Classic Rosskopf Emotion blade",
        "b_description_3": "Vibration: Low\nTouch: Hard\nPly: 7\nComposition: Hinoki Burned, Koto, Carbon, Ayous Nature\nPlaystyle: Off- / Off+\nTechnology: Car\nHead Size: 156mm x 152mm\nThickness: 6.1mm"
    },
    {
        "b_name": "JOOLA Flame Extreme",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-flame-extr",
        "b_speed": 103,
        "b_control": 65,
        "b_weight": "90",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-flame-extr.jpg?8",
        "b_description_1": "One of JOOLA’s fastest blades, but yet still offers amazing touch and ball control.",
        "b_description_2": "",
        "b_description_3": "Pure speed is not the sole motto of the FLAME EXTREME. The intelligent combination of 5 layers with the 0.8mm Liba inner veneer and the new type of BURNtec outer veneers makes it possible not only for professional players to control this blade. The unbeatable price-level will allow everybody to try an “extreme” blade."
    },
    {
        "b_name": "JOOLA Black Rose",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-black-rose",
        "b_speed": 100,
        "b_control": 68,
        "b_weight": "92",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-black-rose.jpg?8",
        "b_description_1": "The new BLACK ROSE guarantees pure ball feeling. The 7-ply wood blade is made from select African Veneers that create a very stable blade for heavy top spins when further away from the table. The extreme balance between maximum control and high speed make this blade a friend of any aggressive top spin player.",
        "b_description_2": "• Offensive 7-ply blade\n• Specially treated veneers create a very stiff and stable blade\n• Suitable for offensive players who play away from the table\n• Made in Sweden",
        "b_description_3": "Vibration: Low\nTouch: Medium\nPly: 7\nComposition: Santos, Koto, Ayous, Ayous\nPlaystyle: All / Off\nTechnology: N/A\nHead Size: 158mm x 150mm\nThickness: 5.7mm"
    },
    {
        "b_name": "JOOLA TPE Fight",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-tpe-fight",
        "b_speed": 100,
        "b_control": 78,
        "b_weight": "92",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-tpe-fight.jpg?8",
        "b_description_1": "A special type of Aramid fiber blade. Only the highest quality material is used to produce the TPE Fight. The extremely quick blade allows heavy topspin balls to be played with feeling and spin. Dynamic speed changes are possible when playing long spin rallies.",
        "b_description_2": "• Very offensive 5+2 ply blade\n• Unique Aramid fiber increases the sweet spot and reduces vibration\n• Suitable for aggressive mid/far distance player\n• Fastest blade in the TPE series",
        "b_description_3": "Packaging of a TPE blade:"
    },
    {
        "b_name": "JOOLA Spirit OFF+",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-spirit-offp",
        "b_speed": 98,
        "b_control": 55,
        "b_weight": "90",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-spirit-offp.jpg?8",
        "b_description_1": "The 6.5mm Balsa/Black Ayous core and 0.8mm Koto Veneer produces an excellent controlled offensive blade with extreme speed and great feeling. The Spirit Off+ is equipped with one of a kind multiple compound system. The veneers are block glued, crosscut, and then glued again for the added structural rigidity without adding additional weight.",
        "b_description_2": "• Offensive+ 5-ply blade\n• Multiple compound system used for added structural rigidity\n• Suitable for Offensive+ players\n• Designed based on the classic Bomb Extreme blade",
        "b_description_3": "Vibration: Medium\nTouch: Medium\nPly: 5\nComposition: Fineline Black, Koto, Balsa/Ayous\nPlaystyle: Off / Off+\nTechnology: MCS\nHead Size: 156mm x 152mm\nThickness: 9.1mm"
    },
    {
        "b_name": "JOOLA Solja Off Plus",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-solja-offp",
        "b_speed": 96,
        "b_control": 71,
        "b_weight": "90",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-solja-offp.jpg?8",
        "b_description_1": "This blade is used by Petrissa Solja, the silver medal winner at the 2016 Olympic Games in the Women’s team event. Since the transition of the plastic ball, Petrissa has been searching for a blade that provides suits her offensive game and offers maximum feeling and precision in blocking and countering rallies. This blade features high quality Hinoki outer veneers to provide great feeling and a powerful blade. The carbon fiber is placed directly on the Kiri core veneer to create an enlarged sweet spot and solid touch. The JOOLA P. SOLJA OFF+ is an offensive blade for players of all classes who prefer a blade with a special touch.",
        "b_description_2": "• Very offensive 5+2 ply blade\n• Carbon increases the sweet spot and reduces vibration\n• Suitable for the modern offensive player who plays close to the table with great speed but require maximum feeling and control\n• Currently used by Petrissa Solja",
        "b_description_3": "Vibration: Medium\nTouch: Hard\nPly: 7\nComposition: Hinoki, Ayous, Carbon, Kiri\nPlaystyle: Off- / Off+\nTechnology: Carbon\nHead Size: 155mm x 151mm\nThickness: 6.3mm"
    },
    {
        "b_name": "JOOLA Mikado Off+",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-mikado-off-p",
        "b_speed": 95,
        "b_control": 80,
        "b_weight": "87",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-mikado-off-p.jpg?8",
        "b_description_1": "The Mikado Off+ was created with the focus of speed in mind. This speed-dominant 7-ply Off+ blade is for the point-oriented top-spinner whose main focus is to hit the ball past their opponents. This one of a kind veneer combination provides not only great speed but maintains excellent feedback.",
        "b_description_2": "• Offensive 7-ply blade\n• Unique veneer combination maintains control while pushing the speed limit\n• Suitable for offensive players who stay close to the table\n• Very quick blade with excellent feedback",
        "b_description_3": "Vibration: Medium\nTouch: Medium\nPly: 7\nComposition: Ayous Black, Pinewood, Ayous, Tungwood\nPlaystyle: Off- / Off\nTechnology: N/A\nHead Size: 157mm x 150mm\nThickness: 6mm"
    },
    {
        "b_name": "JOOLA Viking",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-viking",
        "b_speed": 95,
        "b_control": 74,
        "b_weight": "87",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-viking.jpg?8",
        "b_description_1": "A classic Swedish blade that revives the long JOOLA tradition of blades from Sweden. The 7-ply blade is a standard offensive all wood blade that guarantees fantastic feedback and unbeatable ball feeling.",
        "b_description_2": "• Offensive 7-ply blade\n• Classic Swedish design\n• Suitable for offensive players who play mid distance\n• Made in Sweden",
        "b_description_3": "Packaging of a TPE blade:"
    },
    {
        "b_name": "JOOLA Aruna Off+",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-aruna-off-p",
        "b_speed": 95,
        "b_control": 67,
        "b_weight": "90",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-aruna-off-p.jpg?8",
        "b_description_1": "This is the faster and more aggressive version of the new Aruna Off. It has the basic attributes of the Aruna Off, but with a thicker Kiri core and denser Carbon Veneer. The basic attributes of feeling and controllability are maintained.",
        "b_description_2": "• Offensive 5+2ply blade\n• Carbon fiber veneers creates an increase sweet spot and reduced vibration\n• Suitable for Suitable for offensive players\n• Design was based on the best-selling Rosskopf Force",
        "b_description_3": "Vibration: Medium\nTouch: Hard\nPly: 5+2\nComposition: Hinoki Nature, Carbon, Kiri\nPlaystyle: Off / Off+\nTechnology: Carbon\nHead Size: 155mm x 151mm\nThickness: 6.3mm"
    },
    {
        "b_name": "JOOLA K7",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-k7",
        "b_speed": 95,
        "b_control": 60,
        "b_weight": "90",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-k7.jpg?8",
        "b_description_1": "",
        "b_description_2": "The Carbon-net material was used for the first time in the JOOLA K7. Carbon net is lighter than other carbon fabrics and still provides the required stiffness that player look for in a blade. The Enzo layers provide high control and the RAG handle, exclusively developed by JOOLA, strengthens the control and feel.",
        "b_description_3": "• Offensive 5+2 ply blade\n• Carbon-net fiber veneers creates an increase sweet spot and reduced vibration\n• Suitable for offensive players\n• Fastest blade among the “K” series blades"
    },
    {
        "b_name": "JOOLA K6",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-k6",
        "b_speed": 93,
        "b_control": 60,
        "b_weight": "90",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-k6.jpg?8",
        "b_description_1": "The K6 offers the Round About Grip technology for maximum comfort without compromise. The Blue-Texalium guarantees excellent stiffness while maintaining the size of the sweet spot. Speed and control of the K6 offer perfect playing balance while the RAG grip guarantees excellent ball feedback. JOOLA K6, truly a modern high-tech blade that guarantees all requirements of a top player’s competition blade.",
        "b_description_2": "• Offensive 5+2ply blade\n• Aluminum coated fiberglass fabric creates an enlarged sweet spot and additional control.\n• Suitable for all-round and Offensive players\n• This blade is the perfect balance between speed and control",
        "b_description_3": "Vibration: Low\nTouch: Hard\nPly: 5+2\nComposition: Samba Blue, Limba Nature, Blue Texalium, Samba Nature\nPlaystyle: All / Off+\nTechnology: RAG, Texalium\nHead Size: 158mm x 151mm\nThickness: 6.5mm"
    },
    {
        "b_name": "JOOLA Air Fibre",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-air-fibre",
        "b_speed": 93,
        "b_control": 60,
        "b_weight": "60",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-air-fibre.jpg?8",
        "b_description_1": "JOOLA presents a top-class blade with the JOOLA AIR FIBRE. The single wooden veneers are selected very carefully according to the highest quality standards. This enables the guaranteed feather-weight of 59-60g. The 4mm thick Balsa core is encased with high quality fiber glass which produces pure ball feeling with excellent control values. The JOOLA AIR FIBRE is probably the only blade worldwide, which guarantees the maximum weight of 60 grams! It is an experience to play with this blade!",
        "b_description_2": "• All-round 7ply blade\n• 4mm Balsa Core creates a lightweight, yet stable blade\n• Suitable for close to close to the table blockers and counter hitters\n• Lightest blade in the JOOLA lineup",
        "b_description_3": "Vibration: High\nTouch: Medium\nPly: 5+2\nComposition: Acosica, Samba, Glassfiber, Balsa\nPlaystyle: All / Off-\nTechnology: Fiberglass\nHead Size: 155mm x 149mm\nThickness: 6.1mm"
    },
    {
        "b_name": "JOOLA Rossi Force",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-rossi-force",
        "b_speed": 93,
        "b_control": 68,
        "b_weight": "90",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-rossi-force.jpg?8",
        "b_description_1": "Designed for the uncompromising offensive player who wants a hard, carbon blade. The ROSSKOPF FORCE is a must. Due to the flat trajectory and the enormous acceleration, this offensive blade will produce enough force to win direct points with fast topspin shots. The exclusive design and excellent playing characteristics make the ROSSKOPF FORCE one of JOOLA’s bestsellers.",
        "b_description_2": "• Offensive 5+2 ply blade\n• Unique Hinoki outer ply creates a soft feel without sacrificing speed\n• Suitable for the all-round mid distance player\n• Designed by German National Team coach, Jorg Rosskopf",
        "b_description_3": "Vibration: Low\nTouch: Extra hard\nPly: 7\nComposition: Hinoki Nature, Carbon, Kiri\nPlaystyle: Off / Off+\nTechnology: Carbon\nHead Size: 155mm x 151mm\nThickness: 6.3mm"
    },
    {
        "b_name": "JOOLA Air Carbon",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-air-carbon",
        "b_speed": 92,
        "b_control": 54,
        "b_weight": "72",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-air-carbon.jpg?8",
        "b_description_1": "The JOOLA AIR CARBON is the offensive version of the “Air” Series. The JOOLA AIR fundamental characteristics are maintained due to the 5mm thick Balsa core. This creates a unique playing feeling and increased stability. This version guarantees the weight of the blade is between 71-72g. The JOOLA AIR CARBON gains speed and precision with the 2 carbon layers.",
        "b_description_2": "• Offensive 5+2 ply blade\n• 5mm Balsa Core creates a lightweight, yet stable blade\n• Suitable for close to mid distance blockers and counter hitters\n• Lightest Carbon blade in the JOOLA lineup",
        "b_description_3": "Vibration: Medium\nTouch: Hard\nPly: 5+2\nComposition: Limba, Fineline Grey, Carbon Net, Balsa\nPlaystyle: Off- / Off+\nTechnology: Carbon\nHead Size: 155mm x 149mm\nThickness: 7.6mm"
    },
    {
        "b_name": "JOOLA Solja Off Minus",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-solja-offm",
        "b_speed": 91,
        "b_control": 82,
        "b_weight": "87",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-solja-offm.jpg?8",
        "b_description_1": "This extraordinary 5-ply blade is considerable for players of all performance levels. The secret of the P. SOLJA OFF- is the balance of speed and ball feeling. The slightly thicker Limba outer veneers give the P. SOLJA OFF- a longer dwell time, therefore creating a higher ball trajectory which benefits players who spin. The soft pine veneer provides an equally soft feeling to the player and provides maximum ball control in critical situations. The P. SOLJA OFF- excites most all-round players by its extraordinary playing characteristics. It is suitable for all playing strategies from mid-distance topspin players to block/counter players who play close the table. The P. SOLJA OFF- takes the modern all-round game to the next level!",
        "b_description_2": "• All-round 5ply wood blade\n• Limba/pine wood construction creates longer dwell time and higher ball trajectory\n• Suitable for the modern all-round player who plays close to the table with quick strokes\n• Developed for the close table control play",
        "b_description_3": "Vibration: High\nTouch: Medium\nPly: 5\nComposition: Limba, Pine, Samba\nPlaystyle: All / Off\nTechnology: N/A\nHead Size: 156mm x 149mm\nThickness: 5.8mm"
    },
    {
        "b_name": "JOOLA Aruna Off",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-aruna-off",
        "b_speed": 90,
        "b_control": 75,
        "b_weight": "88",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-aruna-off.jpg?8",
        "b_description_1": "Aruna Off is the current blade of the JOOLA top rising star, Aruna Quadri. He has been using the Aruna Off prior to his sensational performance at the 2014 World Cup in Düsseldorf. This 7-ply blade has good ball feeling and high control. The Aruna Off also has the necessary power for maximum speed due to its modern carbon technology.",
        "b_description_2": "• Offensive 5+2 ply blade\n• Carbon fiber veneers creates an increase sweet spot and reduced vibration\n• Suitable for suitable for all-round and offensive players\n• Currently used by JOOLA’s Top player, Aruna Quadri",
        "b_description_3": "Vibration: Medium\nTouch: Hard\nPly: 5+2\nComposition: Hinoki Nature, Koto, Carbon, Ayous Nature\nPlaystyle: All / Off+\nTechnology: Carbon\nHead Size: 156mm x 152mm\nThickness: 5.9mm"
    },
    {
        "b_name": "JOOLA Eagle Carbon",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-eagle-carbon",
        "b_speed": 90,
        "b_control": 63,
        "b_weight": "85",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-eagle-carbon.jpg?8",
        "b_description_1": "",
        "b_description_2": "The subtle, anthracite colored design indicates the drop-dead carbon philosophy of the Eagle Carbon Extreme. The hard, carbon-reinforced core is veneered with Kiri wood which provides controlled power. The sweet spot is enlarged by Carbon which guarantees the best possible ball feeling for the player.",
        "b_description_3": "• Offensive 5-ply blade\n• Carbon veneer is added to increase the size of the sweet spot and reduce vibration\n• Suitable for close to the table play\n• Fastest blade among the Eagle series"
    },
    {
        "b_name": "JOOLA Fever",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-fever",
        "b_speed": 90,
        "b_control": 85,
        "b_weight": "87",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-fever.jpg?8",
        "b_description_1": "An almost perfect blade with high stability and precise alignment of the center core. The lightweight Meliorate Carbon provides not only an extra-large sweet spot, but also the perfect balance. The Limba veneers allow you to feel every bounce of the ball and therefore give the blade extreme control.",
        "b_description_2": "• Offensive 7-ply blade\n• Meliorate Carbon creates a large sweet spot with unrivaled control\n• Suitable for players who like to play close to the table\n• Head light blade",
        "b_description_3": "Vibration: Low\nTouch: Hard\nPly: 5+2\nComposition: Limba Nature Meliorate Carbon, Ayous Nature, Kiri\nPlaystyle: Off- / Off+\nTechnology: Meliorate Carbon\nHead Size: 155mm x 151mm\nThickness: 5.9mm"
    },
    {
        "b_name": "JOOLA Greenline Extreme",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-green-extreme",
        "b_speed": 90,
        "b_control": 78,
        "b_weight": "87",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-green-extreme.jpg?8",
        "b_description_1": "Extremely fast offensive blade with exclusive Ebano upper veneers and a large sweet spot. Seven veneer layers guarantee pure playing fun with excellent match features.",
        "b_description_2": "",
        "b_description_3": ""
    },
    {
        "b_name": "JOOLA Rossi Emotion",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-rossi-emotion",
        "b_speed": 90,
        "b_control": 73,
        "b_weight": "87",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-rossi-emotion.jpg?8",
        "b_description_1": "The carbon fiber is placed right next to the Ayous core to create an enhanced sweet spot which results in excellent control and feedback. In comparison with other blades with carbon core, the ROSSKOPF EMOTION has a relatively soft feel and a high trajectory due to the specially selected Hinoki surface. The blade offers the best possible balance between feeling and speed in active play.",
        "b_description_2": "• Offensive 5+2 ply blade\n• Unique Hinoki outer ply creates a soft feel without sacrificing speed\n• Suitable for the all-round mid distance player\n• Classic blade used by the German National Team coach, Jorg Rosskopf",
        "b_description_3": "Vibration: Medium\nTouch: Hard\nPly: 5+2\nComposition: Hinoki Nature, Koto, Carbon, Ayous Nature\nPlaystyle: All / Off+\nTechnology: Carbon\nHead Size: 156mm x 152mm\nThickness: 5.9mm"
    },
    {
        "b_name": "JOOLA Flame Fast",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-flame-fast",
        "b_speed": 88,
        "b_control": 80,
        "b_weight": "87",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-flame-fast.jpg?8",
        "b_description_1": "",
        "b_description_2": "The FLAME FAST blade proves that high speed and good control can be achieved with the combination with BURNtec technology. The luxurious 0.8mm Hinoki top ply combined with the BURNtec and the hard Kiri wood core creates maximum torsion rigidity in order to generate maximum power for aggressive top spins and dominating blocks. This is truly a high-class blade for all players.",
        "b_description_3": "• Offensive 5-ply blade\n• BURNtec produces a warp-free blade by removing all moisture from the wood veneers\n• Suitable for offensive players who play close to the table\n• Designed from the Wing Fast blade"
    },
    {
        "b_name": "JOOLA TPE Nature",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-tpe-nature",
        "b_speed": 88,
        "b_control": 90,
        "b_weight": "87",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-tpe-nature.jpg?8",
        "b_description_1": "The TPE Nature is constructed with very light natural Limba and Ayous veneers, which not only ensures the JOOLA Nature has a noble appearance, but also has an exceptional feeling. Whether for offensive topspin balls, hard smashes or well-placed blocks, the JOOLA Nature is the perfect blade.",
        "b_description_2": "• Offensive 7 play blade\n• Limba and Ayous wood veneers create a solid yet controllable experience\n• Suitable for mid-distance play\n• Developed for the plastic ball",
        "b_description_3": "Packaging of a TPE blade:"
    },
    {
        "b_name": "JOOLA Spirit OFF",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-spirit-off",
        "b_speed": 88,
        "b_control": 70,
        "b_weight": "85",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-spirit-off.jpg?8",
        "b_description_1": "The 6mm Balsa/Red Ayous core produces an excellent controlled offensive blade with moderate speed and great feeling. The Spirit Off is equipped with the one of a kind multiple compound system. The veneers are block glued, crosscut, and then glued again for the added structural rigidity without adding additional weight.",
        "b_description_2": "• Offensive 5-ply blade\n• Multiple compound system used for added structural rigidity\n• Suitable for Offensive mid-distance players\n• Designed based on the classic Bomb Fast blade",
        "b_description_3": "Vibration: Medium\nTouch: Medium\nPly: 5\nComposition: Fineline Red, Ayous, Balsa/Ayous\nPlaystyle: Off- / Off\nTechnology: MCS\nHead Size: 156mm x 152mm\nThickness: 8.1mm"
    },
    {
        "b_name": "JOOLA TPE Feeling",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-tpe-feeling",
        "b_speed": 85,
        "b_control": 98,
        "b_weight": "90",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-tpe-feeling.jpg?8",
        "b_description_1": "High quality 5ply wood OFF blade with an exclusive burned Hinoki top ply. The honorable Hinoki wood is heated up using a special technique which ensures a high stiffness and consistent playing features on the whole face of the blade. The soft Ayous and Koto veneers make the blade very controllable without losing much speed.",
        "b_description_2": "• Offensive 5ply blade\n• Burned Hinoki wood combined with Ayous and Koto woods creates a fast yet controllable blade\n• Suitable for close to the table play.\n• TPE Feeling blade has the most control in the TPE Series",
        "b_description_3": "Packaging of a TPE blade:"
    },
    {
        "b_name": "JOOLA TPE Feeling XS",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-tpe-feeling-xs",
        "b_speed": 85,
        "b_control": 98,
        "b_weight": "90",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-tpe-feeling-xs.jpg?8",
        "b_description_1": "JOOLA TPE Feeling XS has smaller face and thinner handle than the JOOLA TPE Feeling blade and is ideal for ambitious children.",
        "b_description_2": "High-quality 5ply wood OFF blade with an exclusive burned Hinoki top ply. The honorable Hinoki wood is heated up using a special technique which ensures a high stiffness and consistent playing features on the whole face of the blade. The soft Ayous and Koto veneers make the blade very controllable without losing much speed.",
        "b_description_3": "• Offensive 5ply blade\n• Burned Hinoki wood combined with Ayous and Koto woods creates a fast yet controllable blade\n• Suitable for close to the table play.\n• TPE Feeling blade has the most control in the TPE Series"
    },
    {
        "b_name": "JOOLA Mikado Off",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-mikado-off",
        "b_speed": 85,
        "b_control": 88,
        "b_weight": "82",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-mikado-off.jpg?8",
        "b_description_1": "The Mikado Off is a 5-ply offensive blade with plenty of dwell time. This makes this blade ideal for a spin-orientated offensive game. The blade is able to create a decent arc when playing topspin shots away from the table, guaranteeing full control of the game.",
        "b_description_2": "• Offensive 5-ply blade\n• Combination of Ayous and Tungwood creates exceptional dwell time\n• Suitable for offensive players who like to play further back from the table\n• Perfect for players who like to step back from the table and rally",
        "b_description_3": "Vibration: High\nTouch: Soft\nPly: 5\nComposition: Ayous Blue, Ayous, Tungwood\nPlaystyle: Off- / Off\nTechnology: N/A\nHead Size: 157mm x 150mm\nThickness: 6mm"
    },
    {
        "b_name": "JOOLA Colt Off Speed",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-colt-speed",
        "b_speed": 85,
        "b_control": 62,
        "b_weight": "80",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-colt-speed.jpg?8",
        "b_description_1": "Equipped with an ergonomic handle and lots of power for the active spin-oriented player, this is the hallmark of this modern OFF- blade with balsa core. Together with the new ergonomic handle, the Colt OFF Speed stands for pure pleasure when playing!",
        "b_description_2": "• Offensive 5-ply blade\n• Balsa core allows for power with added feeling at the lightest weight ratio\n• Suitable for players who want a light blade without sacrificing speed\n• Unique ergonomic design",
        "b_description_3": "Vibration: Medium\nTouch: Soft\nPly: 5\nComposition: Limba, Makore, Balsa\nPlaystyle: Off- / Off\nTechnology: Balsa\nHead Size: 157mm x 150mm\nThickness: 8.1mm"
    },
    {
        "b_name": "JOOLA Falcon Fast Plus",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-falcon-fast-p",
        "b_speed": 85,
        "b_control": 78,
        "b_weight": "82",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-falcon-fast-p.jpg?8",
        "b_description_1": "High quality veneers combined to create an exceptional configuration. The offensive blade provides precision at high speeds with moderate feedback. White Burch mid-veneers compliments the Ebony top veneer with the balance of speed and control.",
        "b_description_2": "• Offensive 7-ply blade\n• Combination of ebony, spruce, white birch, and tungwood creates a fast but controllable blade\n• Suitable for players who like play with great spin and speed\n• Visually attractive blade with a great value",
        "b_description_3": "Vibration: Low\nTouch: Medium\nPly: 7\nComposition: Ebony, Spruce, Birch, Tungwood\nPlaystyle: All / Off\nTechnology:\nHead Size: 158mm x 151mm\nThickness: 5.8mm"
    },
    {
        "b_name": "JOOLA Eagle Fast",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-eagle-fast",
        "b_speed": 83,
        "b_control": 85,
        "b_weight": "72",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-eagle-fast.jpg?8",
        "b_description_1": "The EAGLE FAST is a low-budget Balsa blade. The high quality manufactured offensive blade weighs only 70 grams. This fast yet controllable blade will allow the user to execute heavy top spins while maintaining control on softer shots.",
        "b_description_2": "• All-round 5-ply blade\n• Balsa core allows for power with added feeling at the lightest weight ratio\n• Suitable for players who want a light blade without sacrificing control\n• Lightest blade in the Eagle series",
        "b_description_3": "Vibration: High\nTouch: Soft\nPly: 5\nComposition: Fineline Red, Tanne, Balsa\nPlaystyle: All / Off\nTechnology: Balsa\nHead Size: 156mm x 152mm\nThickness: 8.3mm"
    },
    {
        "b_name": "JOOLA Falcon Fast",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-falcon-fast",
        "b_speed": 83,
        "b_control": 98,
        "b_weight": "82",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-falcon-fast.jpg?8",
        "b_description_1": "A 7-layered blade has exceptional control and offensive characteristics. The top veneers consist of Lymph-Wood, which provide speed and sensational touch when hitting topspin. The 5 soft Ayous layers provide great control without sacrificing considerable speed.",
        "b_description_2": "• Offensive 7-ply blade\n• Stiff outer ply wood combined with softer veneers creates a balanced speed blade\n• Suitable for all-round and offensive players\n• Maximum feeling and stability on top spin strokes",
        "b_description_3": "Vibration: Medium\nTouch: Medium\nPly: 7\nComposition: Lymphwood, Ayous Nature, Ayous Nature, Ayous Nature\nPlaystyle: All / Off\nTechnology: N/A\nHead Size: 158mm x 151mm\nThickness: 6.4mm"
    },
    {
        "b_name": "JOOLA Colt Off Control",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-colt-control",
        "b_speed": 82,
        "b_control": 69,
        "b_weight": "85",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-colt-control.jpg?8",
        "b_description_1": "This blade is equipped with an ergonomic handle and lots of control for the active spin-oriented player. Together with the new ergonomic handle, the Colt OFF Control stands for pure pleasure when playing!",
        "b_description_2": "• Offensive 5-ply blade\n• Limba/samba veneers combination offers great control\n• Suitable for players who want a light blade without sacrificing control.\n• Unique ergonomic design",
        "b_description_3": "Vibration: Medium\nTouch: Medium\nPly: 5\nComposition: Limba, Black Limba, Samba\nPlaystyle: All / Off-\nTechnology:\nHead Size: 157mm x 150mm\nThickness: 5.9mm"
    },
    {
        "b_name": "JOOLA Rossi Fire",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-rossi-fire-07",
        "b_speed": 80,
        "b_control": 80,
        "b_weight": "85",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-rossi-fire-07.jpg?8",
        "b_description_1": "A classic amongst fast offensive blades! Seven specially selected veneers provide high torsion rigidity. The blade is ideal for a close-to-the-table speed orientated attacking game. The veneers on this blade are block glued, cross cut, and glued again. This process creates a solid feel and increased dwell time.",
        "b_description_2": "• Offensive 5+2 ply blade\n• RAG technology for added feeling and increased dwell time\n• Suitable for offensive players who stay close the table\n• Developed for the close table control play",
        "b_description_3": "Vibration: Medium\nTouch: Medium\nPly: 7\nComposition: Limba Nature, Samba Nature, Enzo, Samba Nature\nPlaystyle: Off- / Off\nTechnology: RAG\nHead Size: 156mm x 149mm\nThickness: 6mm"
    },
    {
        "b_name": "JOOLA O Degree Carbon",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-o-degree-c",
        "b_speed": 80,
        "b_control": 72,
        "b_weight": "80",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-o-degree-c.jpg?8",
        "b_description_1": "The JOOLA O° Carbon Blade is an incredibly responsive blade featuring 5 layers of wood veneers and 2 layers of carbon. The carbon provides an increased sweet spot, which results in a more sensitive feel of the ball.",
        "b_description_2": "7-ply Blade: 0.8mm Ayous, 0.6mm Ayous, 0.15mm Carbon, 3.5mm Tungwood, 0.15mm Carbon, 0.6mm Ayous, 0.8mm Ayous",
        "b_description_3": "Final blade thickness is about 6.20mm ± 0.20mm"
    },
    {
        "b_name": "JOOLA Viva",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-viva",
        "b_speed": 80,
        "b_control": 100,
        "b_weight": "85",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-viva.jpg?8",
        "b_description_1": "The VIVA is a remodel of the legendary VIVA blade. The 7-layer blade offers excellent balance and control. The VIVA is a proven top offensive blade at an unbeatable price.",
        "b_description_2": "• Offensive 7-ply blade\n• Samba and Limba woods produces a unique feel and increased dwell time\n• Suitable for mid distance offensive players\n• Remodeled after the classic Viva blade",
        "b_description_3": "Vibration: Medium\nTouch: Hard\nPly: 7\nComposition: Limba Nature, Samba Nature, Samba Red, Samba Nature\nPlaystyle: Off- / Off+\nTechnology: N/A\nHead Size: 159mm x 146mm\nThickness: 6.6mm"
    },
    {
        "b_name": "JOOLA Torre Carbon",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-torre-c",
        "b_speed": 79,
        "b_control": 66,
        "b_weight": "n/a",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-torre-c.jpg?8",
        "b_description_1": "The Torre Carbon blade is a unique construction of 5-ply wood and 2-ply carbon, giving this nimble blade an enlarged sweet-spot.",
        "b_description_2": "Ply: 5+2\nSpeed: 79\nControl: 66",
        "b_description_3": "Blade FAQ and Guide - what you need to know when buying a blade."
    },
    {
        "b_name": "JOOLA K5",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-k5",
        "b_speed": 78,
        "b_control": 95,
        "b_weight": "85",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-k5.jpg?8",
        "b_description_1": "The JOOLA K5 does not only fall into the category of first class high-tech blades due to its exclusive design, but it also achieves great feel and vibration control with the Rag Technology. The K5 is one of JOOLA’s bestsellers.",
        "b_description_2": "• All-round/Offensive 5ply blade\n• RAG technology for added feeling and increased dwell time\n• Suitable for all-round and pffensive players\n• JOOLA’s classic 5-ply wood blade",
        "b_description_3": "Vibration: Medium\nTouch: Medium\nPly: 5\nComposition: Samba Yellow, Limba Nature, Samba Nature\nPlaystyle: Off- / Off+\nTechnology: RAG\nHead Size: 156mm x 151mm\nThickness: 6mm"
    },
    {
        "b_name": "JOOLA Torre Off",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-torre-off",
        "b_speed": 76,
        "b_control": 68,
        "b_weight": "n/a",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-torre-off.jpg?8",
        "b_description_1": "The Torre Off 5-ply wood blade offers a slightly stiffer wood combination. The firmer blade allows for high acceleration without losing ball control.",
        "b_description_2": "Ply: 5\nSpeed: 76\nControl: 68",
        "b_description_3": "Blade FAQ and Guide - what you need to know when buying a blade."
    },
    {
        "b_name": "JOOLA Falcon Medium",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-falcon-med",
        "b_speed": 75,
        "b_control": 100,
        "b_weight": "80",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-falcon-med.jpg?8",
        "b_description_1": "5-ply blade with excellent control and feedback characteristics. The top Ayous veneers combined with the Tungwood core provides this blade with superb feeling and moderate speed.",
        "b_description_2": "• All-round 5ply blade\n• 5ply wood construction creates more dwell time and feeling\n• Suitable for all-round and offensive players\n• This blade has the most control in the falcon blade series",
        "b_description_3": "Vibration: High\nTouch: Soft\nPly: 5\nComposition: Ayous Nature, Ayous Nature, Tungwood\nPlaystyle: Def / All\nTechnology:\nHead Size: 158mm x 151mm\nThickness: 6.8mm"
    },
    {
        "b_name": "JOOLA Spirit ALL+",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-spirit-allp",
        "b_speed": 73,
        "b_control": 76,
        "b_weight": "80",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-spirit-allp.jpg?8",
        "b_description_1": "The 4.5mm Balsa/Blue Ayous core produces an excellent controlled all-round blade with moderate speed and great feeling. The Spirit All-round is equipped with a one of a kind multiple compound system. The veneers are block glued, crosscut, and then glued again for the added structural rigidity without an additional weight.",
        "b_description_2": "• All-round 5-ply blade\n• Multiple compound system used for added structural rigidity\n• Suitable for All-round mid-distance players\n• This blade has the most control in the Spirit Series",
        "b_description_3": "Vibration: Medium\nTouch: Soft\nPly: 5\nComposition: Fineline Blue, Koto, Balsa/Ayous\nPlaystyle: All / Off-\nTechnology: MCS\nHead Size: 156mm x 152mm\nThickness: 6.4mm"
    },
    {
        "b_name": "JOOLA Torre All+",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-torre-allp",
        "b_speed": 72,
        "b_control": 76,
        "b_weight": "n/a",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-torre-allp.jpg?8",
        "b_description_1": "The Torre All+ 5-ply wood blade offers remarkable control and stability. This blade not only gives the user great feeling, but still offers enough speed for a strong offensive game.",
        "b_description_2": "Ply: 5\nSpeed: 72\nControl: 76",
        "b_description_3": "Blade FAQ and Guide - what you need to know when buying a blade."
    },
    {
        "b_name": "JOOLA Wing Medium",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-wing-medium",
        "b_speed": 70,
        "b_control": 88,
        "b_weight": "80",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-wing-medium.jpg?8",
        "b_description_1": "Wing Shaft Integration Technology provides a totally innovative feel. The handle is integrated into the blade like a wing thus providing excellent stability and control. The layers of luxurious Hinoki are ergonomically shaped into the handle so that the grip fits perfectly in the hand. The combination of veneers provides well-balanced playing features and is ideal for players who play with a lot of spin.",
        "b_description_2": "• All-round 5-ply blade\n• Wing Shaft Integration Technology provides excellent stability\n• Suitable for intermediate players who mainly focus on spin\n• Versatility at its finest",
        "b_description_3": "Vibration: Medium\nTouch: Medium\nPly: 5\nComposition: Koto, Ayous, Kiri\nPlaystyle: All / Off-\nTechnology: WSI\nHead Size: 155mm x 152mm\nThickness: 6.2mm"
    },
    {
        "b_name": "JOOLA Wing Medium Jr",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-wing-medium-jr",
        "b_speed": 70,
        "b_control": 88,
        "b_weight": "80",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-wing-medium-jr.jpg?8",
        "b_description_1": "This is the junior version of JOOLA Wing Medium.",
        "b_description_2": "Wing Shaft Integration Technology provides a totally innovative feel. The handle is integrated into the blade like a wing thus providing excellent stability and control. The layers of luxurious Hinoki are ergonomically shaped into the handle so that the grip fits perfectly in the hand. The combination of veneers provides well-balanced playing features and is ideal for players who play with a lot of spin.",
        "b_description_3": "• All-round 5-ply blade\n• Wing Shaft Integration Technology provides excellent stability\n• Suitable for intermediate players who mainly focus on spin\n• Versatility at its finest"
    },
    {
        "b_name": "JOOLA O Degree Offense",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-o-degree-off",
        "b_speed": 70,
        "b_control": 77,
        "b_weight": "80",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-o-degree-off.jpg?8",
        "b_description_1": "This dynamic and relatively stiff all wooden 7-ply blade provides good ball feedback and control.",
        "b_description_2": "7-ply blade: 0.6mm Ayous, 0.6mm Basswood, 0.18mm Birchwood, 4.0mm Tungwood, 0.18mm Birchwood, 0.6mm Basswoo, 0.6mm Ayous",
        "b_description_3": "Final blade thickness is ca. 6.20mm ± 0.20mm"
    },
    {
        "b_name": "JOOLA Mikado All+",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-mikado-all-p",
        "b_speed": 68,
        "b_control": 98,
        "b_weight": "82",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-mikado-all-p.jpg?8",
        "b_description_1": "The Mikado All+ was produced for the players who mainly focus on control and placement. This 5-ply wood blade offers balanced playing features for all situations.",
        "b_description_2": "• All-round 5-ply blade\n• Moderate weight blade with good feedback and precisio\n• Suitable for all-round players who play close to the table\n• Perfect blade for kids and beginners/intermediate players",
        "b_description_3": "Vibration: High\nTouch: Soft\nPly: 5\nComposition: Baswood Grey, Tungwood, Tungwood\nPlaystyle: Off- / Off\nTechnology: N/A\nHead Size: 157mm x 150mm\nThickness: 5.6mm"
    },
    {
        "b_name": "JOOLA Eagle Medium",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-eagle-med",
        "b_speed": 68,
        "b_control": 80,
        "b_weight": "77",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-eagle-med.jpg?8",
        "b_description_1": "High control, respectable speed, and very low weight are the secrets of the EAGLE MEDIUM. This blade allows young ambitious table tennis players the fun of playing table tennis with a well-engineered blade. Well-balanced with speed and control, the EAGLE MEDIUM is a suitable beginner blade for kids.",
        "b_description_2": "• All-round 5-ply blade\n• Lightweight blade with good feedback and precision\n• Suitable for beginners and kids\n• Perfect balance between speed, spin, and feeling",
        "b_description_3": "Vibration: High\nTouch: Soft\nPly: 5\nComposition: Fineline Blue, Ayous Black, Kiri\nPlaystyle: Def+ / Off-\nTechnology: N/A\nHead Size: 156mm x 152mm\nThickness: 6.1mm"
    },
    {
        "b_name": "JOOLA Rosskopf Allround",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-rossi-all",
        "b_speed": 65,
        "b_control": 90,
        "b_weight": "90",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-rossi-all.jpg?8",
        "b_description_1": "The Rosskopf Allround provides ideal control values due to the special 7-ply construction and provides excellent ball feeling. With the ROSSKOPF ALLROUND you always have the right answer, in subtle attacks, blocks, and counter play.",
        "b_description_2": "• All-round 5+2 ply blade\n• Unique flow glue technology provides an almost vibration free feel\n• Suitable for all-round players and beginners\n• One of JOOLA’s most popular blades",
        "b_description_3": "Vibration: Low\nTouch: Soft\nPly: 7\nComposition: Limba Nature, Enzo, Samba nature, Enzo, Samba Nature\nPlaystyle: All / Off-\nTechnology: Flow Glue\nHead Size: 156mm x 149mm\nThickness: 6.1mm"
    },
    {
        "b_name": "JOOLA O Degree Allround",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-o-degree-all",
        "b_speed": 63,
        "b_control": 79,
        "b_weight": "80",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-o-degree-all.jpg?8",
        "b_description_1": "Medium-hard allround blade with 5 wood veneers for a dynamic game with a lot of control. Blade has remarkable elasticity and offers enough speed for offensive play.",
        "b_description_2": "5 ply: Basswood, Basswood, Tungwood, Basswood, Basswood",
        "b_description_3": "Speed: 63\nControl 79\nWeight: 80g"
    },
    {
        "b_name": "JOOLA Rossi Jr",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-rossi-jr",
        "b_speed": 63,
        "b_control": 88,
        "b_weight": "80",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-rossi-jr.jpg?8",
        "b_description_1": "The ROSSKOPF JUNIOR is the exact reproduction of the ROSSKOPF ALLROUND with the exception that the blade is specially designed with a smaller and thinner handle. In order to keep the balance of the blade, the surface is slightly smaller. The result is the ROSSKOPF JUNIOR, the ideal blade fit for children.",
        "b_description_2": "• All-round 5+2 ply blade\n• Unique flow glue technology provides an almost vibration free feel.\n• Suitable for all-round players and beginners\n• Blade is specifically designed for kids.",
        "b_description_3": "Vibration: Low\nTouch: Soft\nPly: 7\nComposition: Limba Nature, Enzo, Samba nature, Enzo, Samba Nature\nPlaystyle: Def- / All\nTechnology: Flow Glue, Junior Blade\nHead Size: 151mm x 145mm\nThickness: 6mm"
    },
    {
        "b_name": "JOOLA Chen Weixing",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-chen-weixing",
        "b_speed": 60,
        "b_control": 95,
        "b_weight": "90",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-chen-weixing.jpg?8",
        "b_description_1": "Designed by Europe’s best modern defensive player, this blade is best suited for the controlled defensive game. The blade has great feeling and can smoothly transition to offensive play in a heartbeat. The inner black-cloth layers provide increased control and reduce vibration.",
        "b_description_2": "• Defensive 7-ply blade\n• Black cloth layers provide additional control and structural rigidity\n• Suitable for the modern defender\n• Oversize racket",
        "b_description_3": "Vibration: Medium\nTouch: Soft\nPly: 7\nComposition: Limba Nature, koto, black cloth, Kiri\nPlaystyle:\nTechnology:\nHead Size: 165mm x 159mm\nThickness: 5.9mm"
    },
    {
        "b_name": "JOOLA Chen Defender",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-chen-defender",
        "b_speed": 55,
        "b_control": 104,
        "b_weight": "90",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-chen-defender.jpg?8",
        "b_description_1": "The Chen Weixing Defensive blade has been one of the most popular defensive blades for decades. Working with the world class defensive player from Austria, JOOLA has developed a blade designed for the modern defender. The Enzo glue layer between 2 Samba veneers provides superior control, tremendous feel and prolonged dwell time.",
        "b_description_2": "• Defensive 7-ply blade\n• Enzo glue layer provides superior control and great dwell time\n• Suitable for the modern defender\n• Oversized racket",
        "b_description_3": "Vibration: High\nTouch: Soft\nPly: 7\nComposition: Samba Yellow, Samba Nature, Enzo, Samba Nature\nPlaystyle: Def- / All\nTechnology: N/A\nHead Size: 165mm x 159mm\nThickness: 7.5mm"
    },
    {
        "b_name": "JOOLA Toni Hold White Spot",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-toni-hold",
        "b_speed": 53,
        "b_control": 100,
        "b_weight": "85",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-toni-hold.jpg?8",
        "b_description_1": "This classic defensive blade is specifically designed for anti-top rubbers. The cottonwood veneers are extremely soft and very slow providing great control and power absorption.",
        "b_description_2": "• Defensive 5-ply blade\n• Designed to be used with anti-spin rubbers\n• Suitable for close to the table defensive play\n• JOOLA’s slowest blade",
        "b_description_3": "Vibration: High\nTouch: Extra Soft\nPly: 5\nComposition: Pappel, Pappel, Pappel\nPlaystyle: Def- / Def+\nTechnology: N/A\nHead Size: 163mm x 155mm\nThickness: 5.7mm"
    },
    {
        "b_name": "JOOLA Chen Weixing Jr",
        "b_url": "https://www.megaspin.net/store/default.asp?pid=j-weixing-jr",
        "b_speed": 50,
        "b_control": 98,
        "b_weight": "80",
        "b_bendResist": "n/a",
        "b_image": "https://www.megaspin.net/store/images/products/zoom_j-weixing-jr.jpg?8",
        "b_description_1": "Chen Wei-xing has applied the knowledge gained from training with young Chinese players in the past and has applied it to this junior blade. It is a well-balanced blade for a junior’s hand. The blade has well-balanced speed and control, making it perfect for learning basic strokes.",
        "b_description_2": "• All-around 5-ply blade\n• Perfect for beginners learning basic strokes\n• Suitable for Juniors\n• Junior Blade",
        "b_description_3": "Vibration: High\nTouch: Soft\nPly: 5\nComposition: Koto Nature, Mahagony, Tungwood\nPlaystyle: Def- / All\nTechnology: Junior Blade\nHead Size: 152mm x 142mm\nThickness: 6.8mm"
    },

    {
        "r_name": "729 729-08ES",
        "link": "https://www.megaspin.net/store/default.asp?pid=r-729-08-es",
        "r_spin": "120",
        "r_speed": "110",
        "r_control": "120",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_r-729-08-es.jpg?8",
        "r_description_1": "729-08ES is the energy version of the 729-08 series. Sealed in a special package coupled with a light pink 45deg powerful energy storing sponge.",
        "r_description_2": "Speed: 110\nSpin: 120\nControl:120"
    },
    {
        "r_name": "729 Cross",
        "link": "https://www.megaspin.net/store/default.asp?pid=fr-729-cross",
        "r_spin": "100",
        "r_speed": "100",
        "r_control": "100",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_fr-729-cross.jpg?8",
        "r_description_1": "729 is relatively soft, light and great for accurate ball placement, rally and transitional game in addition to the traditional tackiness. The sponge is the new energy storage CROSS sponge.",
        "r_description_2": "Sponge Hardness 42\nBlack side: blue sponge\nRed side: red sponge"
    },
    {
        "r_name": "729 Top Point",
        "link": "https://www.megaspin.net/store/default.asp?pid=729-top-point",
        "r_spin": "110",
        "r_speed": "120",
        "r_control": "110",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_729-top-point.jpg?8",
        "r_description_1": "Top Point is an aggressive mechanical grip (like European style rubbers), to provide spin and speed. Suitable for Mid distance and away from the table play, also makes a great aggressive backhand rubber",
        "r_description_2": "High speed inverted rubber\nSuperior speed and spin"
    },
    {
        "r_name": "Andro Backside 20D",
        "link": "https://www.megaspin.net/store/default.asp?pid=a-backside-20d",
        "r_spin": "103",
        "r_speed": "85",
        "r_control": "97",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Blowfish",
        "link": "https://www.megaspin.net/store/default.asp?pid=a-blowfish",
        "r_spin": "83",
        "r_speed": "106",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Blowfish Plus",
        "link": "https://www.megaspin.net/store/default.asp?pid=a-blowfish-plus",
        "r_spin": "81",
        "r_speed": "107",
        "r_control": "77",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Chaos",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-chaos",
        "r_spin": "73",
        "r_speed": "75",
        "r_control": "87",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro GTT 40",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-gtt-40",
        "r_spin": "101",
        "r_speed": "96",
        "r_control": "92",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro GTT 45",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-gtt-45",
        "r_spin": "105",
        "r_speed": "89",
        "r_control": "84",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Hexer",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-hexer",
        "r_spin": "109",
        "r_speed": "107",
        "r_control": "78",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Hexer Grip",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-hexer-g",
        "r_spin": "92",
        "r_speed": "93",
        "r_control": "72",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Hexer Grip SFX",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-hexer-g-sfx",
        "r_spin": "92",
        "r_speed": "90",
        "r_control": "74",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Hexer HD",
        "link": "https://www.megaspin.net/store/default.asp?pid=a-hexer-hd",
        "r_spin": "110",
        "r_speed": "113",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Hexer Pips Plus",
        "link": "https://www.megaspin.net/store/default.asp?pid=a-hexer-pips-p",
        "r_spin": "88",
        "r_speed": "104",
        "r_control": "83",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Hexer Powergrip",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-hexer-pg",
        "r_spin": "92",
        "r_speed": "94",
        "r_control": "71",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Hexer PowerGrip SFX",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-hexer-pg-sfx",
        "r_spin": "92",
        "r_speed": "90",
        "r_control": "74",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Hexer Powersponge",
        "link": "https://www.megaspin.net/store/default.asp?pid=a-hexer-ps",
        "r_spin": "110",
        "r_speed": "101",
        "r_control": "96",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Hexer+",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-hexer-plus",
        "r_spin": "108",
        "r_speed": "109",
        "r_control": "79",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Impuls Speed",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-impuls-speed",
        "r_spin": "105",
        "r_speed": "89",
        "r_control": "84",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Plasma 380",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-plasma-380",
        "r_spin": "101",
        "r_speed": "96",
        "r_control": "92",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Plasma 430",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-plasma-430",
        "r_spin": "103",
        "r_speed": "105",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Plasma 470",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-plasma-470",
        "r_spin": "105",
        "r_speed": "110",
        "r_control": "75",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Plaxon 350",
        "link": "https://www.megaspin.net/store/default.asp?pid=a-plaxon-350",
        "r_spin": "101",
        "r_speed": "96",
        "r_control": "92",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Plaxon 400",
        "link": "https://www.megaspin.net/store/default.asp?pid=a-plaxon-400",
        "r_spin": "103",
        "r_speed": "105",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Plaxon 450",
        "link": "https://www.megaspin.net/store/default.asp?pid=a-plaxon-450",
        "r_spin": "105",
        "r_speed": "110",
        "r_control": "75",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Plaxon 525",
        "link": "https://www.megaspin.net/store/default.asp?pid=a-plaxon-525",
        "r_spin": "105",
        "r_speed": "110",
        "r_control": "75",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Rasanter R37",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-rasanter-r37",
        "r_spin": "126",
        "r_speed": "113",
        "r_control": "91",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Rasanter R42",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-rasanter-r42",
        "r_spin": "126",
        "r_speed": "117",
        "r_control": "88",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Rasanter R47",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-rasanter-r47",
        "r_spin": "126",
        "r_speed": "120",
        "r_control": "85",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Rasanter R50",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-rasanter-r50",
        "r_spin": "126",
        "r_speed": "124",
        "r_control": "82",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Rasanter V42",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-rasanter-v42",
        "r_spin": "124",
        "r_speed": "120",
        "r_control": "90",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Rasanter V47",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-rasanter-v47",
        "r_spin": "124",
        "r_speed": "126",
        "r_control": "87",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Revo Fire",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-revo-fire",
        "r_spin": "102",
        "r_speed": "101",
        "r_control": "84",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Rocket Medium",
        "link": "https://www.megaspin.net/store/default.asp?pid=a-rocket-med",
        "r_spin": "100",
        "r_speed": "97",
        "r_control": "87",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Roxon 450",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-roxon-450",
        "r_spin": "105",
        "r_speed": "110",
        "r_control": "75",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Roxon 500 Pro",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-roxon-500",
        "r_spin": "107",
        "r_speed": "115",
        "r_control": "74",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Shifter",
        "link": "https://www.megaspin.net/store/default.asp?pid=andro-shifter",
        "r_spin": "104",
        "r_speed": "94",
        "r_control": "94",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Andro Shifter Powersponge",
        "link": "https://www.megaspin.net/store/default.asp?pid=a-shifter-ps",
        "r_spin": "106",
        "r_speed": "92",
        "r_control": "95",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Butterfly Bryce",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-bryce",
        "r_spin": "95",
        "r_speed": "120",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-bryce.jpg?8",
        "r_description_1": "The World's First High Tension Rubber",
        "r_description_2": "Powered by High Tension, which reduces energy loss at the ball rebound as much as 18% compared to other rubbers."
    },
    {
        "r_name": "Butterfly Bryce FX",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-bryce-fx",
        "r_spin": "95",
        "r_speed": "120",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-bryce-fx.jpg?8",
        "r_description_1": "The High Tension Rubber with a Softer Touch",
        "r_description_2": "BRYCE SPEED FX uses the same rubber as BRYCE SPEED but it possesses a softer & more flexible sponge, the effect is greater control."
    },
    {
        "r_name": "Butterfly Bryce HighSpeed",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-bryce-high-speed",
        "r_spin": "103",
        "r_speed": "145",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-bryce-high-speed.jpg?8",
        "r_description_1": "High-Performance Rubber with Unique Technology \"Micro Layer\"",
        "r_description_2": "â¢ Powered by High Tension and featuring Butterfly's latest technology, Microlayer\nâ¢ Microlayer technology provides increased speed and spin due to its thin surface design\nâ¢ The thinner rubber surface grips more of the ball than ever before\nâ¢ Offering more speed and spin than Bryce Speed, Bryce High Speed is Butterfly's fastest rubber"
    },
    {
        "r_name": "Butterfly Bryce Speed",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-bryce-speed",
        "r_spin": "97",
        "r_speed": "140",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-bryce-speed.jpg?8",
        "r_description_1": "High Tension Rubber Which Goes Beyond BRYCE",
        "r_description_2": "â¢ For champions of the next generation\nâ¢ More speed & power than BRYCE.\nâ¢ Produced under strict quality control, BRYCE SPEED has a higher energy efficiency, more speed & greater power than BRYCE.\nâ¢ Try BRYCE SPEED and experience the superb advanced High Tension technology of Butterfly."
    },
    {
        "r_name": "Butterfly Bryce Speed FX",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-bryce-speed-fx",
        "r_spin": "97",
        "r_speed": "140",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-bryce-speed-fx.jpg?8",
        "r_description_1": "BRYCE SPEED With Higher Control",
        "r_description_2": "BRYCE SPEED FX uses the same rubber as BRYCE SPEED but it possesses a softer & more flexible sponge, the effect is greater control."
    },
    {
        "r_name": "Butterfly Challenger Attack",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-chall-a",
        "r_spin": "65",
        "r_speed": "95",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-chall-a.jpg?8",
        "r_description_1": "Pimples-Out Rubber for Quick Attack",
        "r_description_2": "Ideal for the pips-out player looking for more spin variation as well as easy control over the opponent's shots."
    },
    {
        "r_name": "Butterfly Dignics 05",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-dignics-05",
        "r_spin": "120",
        "r_speed": "135",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-dignics-05.jpg?8",
        "r_description_1": "DIGNICS guides your play to a more advanced level.",
        "r_description_2": "The essence is the combination of Spring Sponge X, the advanced version of Spring Sponge which has more elasticity; the uniquely composed top sheet, with strengthened abrasion, proves great resistance on the surface, providing the feeling of holding the ball at impact."
    },
    {
        "r_name": "Butterfly Feint AG",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-feint-ag",
        "r_spin": "40",
        "r_speed": "70",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-feint-ag.jpg?8",
        "r_description_1": "High Tension Long Pimpled Rubber For Attacking Players",
        "r_description_2": "Feint AG features softer more flexible pips and Butterfly's famous High Tension technology."
    },
    {
        "r_name": "Butterfly Feint Long II",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-feint-l2",
        "r_spin": "32",
        "r_speed": "62",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-feint-l2.jpg?8",
        "r_description_1": "Long Pimpled Rubber For Steady Spins",
        "r_description_2": "â¢ The effect of long pips-out rubbers is maximized when the pips are easily bent & deformed.\nâ¢ The thinner & taller the pips, the more effective.\nâ¢ The aspect ratio (the length of the pips divided by the width of its top) of Feint Long II has reached the limits of the ITTF rule."
    },
    {
        "r_name": "Butterfly Feint Long II OX",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-feint-l2-ox",
        "r_spin": "32",
        "r_speed": "62",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-feint-l2.jpg?8",
        "r_description_1": "Long Pimpled Rubber For Steady Spins",
        "r_description_2": "â¢ The effect of long pips-out rubbers is maximized when the pips are easily bent & deformed.\nâ¢ The thinner & taller the pips, the more effective.\nâ¢ The same top sheet as Feint Long-II, but with no sponge."
    },
    {
        "r_name": "Butterfly Feint Long III",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-feint-l3",
        "r_spin": "40",
        "r_speed": "60",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-feint-l3.jpg?8",
        "r_description_1": "Long Pimpled Rubber with Amazing Variety of Spins",
        "r_description_2": "Designed for the aggressive chopper, Feint Long III features a softer more flexible top sheet combined with a softer sponge."
    },
    {
        "r_name": "Butterfly Feint OX",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-feint-ox",
        "r_spin": "35",
        "r_speed": "45",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-feint-ox.jpg?8",
        "r_description_1": "Well-Balanced Long Pimpled Rubber Without Sponge",
        "r_description_2": "The Feint OX surface sheet without sponge backing."
    },
    {
        "r_name": "Butterfly Feint Soft",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-feint-s",
        "r_spin": "35",
        "r_speed": "55",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-feint-s.jpg?8",
        "r_description_1": "Well-Balanced Long Pimpled Rubber",
        "r_description_2": "â¢ Feint Soft is a standard long pips-out rubber that is outstanding for chopping against topspin drives.\nâ¢ The long pips send your opponent's spin back to him/her.\nâ¢ Usually used in combination with a high spin inverted rubber to force errors from the opponent."
    },
    {
        "r_name": "Butterfly Flarestorm",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-flarestorm",
        "r_spin": "60",
        "r_speed": "110",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "Butterfly is proud to announce a real breakthrough in short pip rubber development. Our new Flarestorm Short Pimpled Rubber combines the classic short pip characteristics of quick rebound and flat drives with our High Tension Technology. The result is that short pips attackers now have a rubber that can match the explosiveness of a powerful topspin drive from the fastest inverted rubbers. At the same time, Flarestorm controls your opponentâs spin well and offers a high level of control in the short game. This rubber will definitely allow you to drive your opponents back from the table and penetrate their defenses with overwhelming power. Light your own storm with Flarestorm.",
        "r_description_2": "Speed: 110\nSpin: 60\nDensity: 36\nReglue Effect: Medium"
    },
    {
        "r_name": "Butterfly Flarestorm II",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-flarestorm-ii",
        "r_spin": "67",
        "r_speed": "117",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-flarestorm-ii.jpg?8",
        "r_description_1": "High Tension Pimples-out with High Reaction",
        "r_description_2": "â¢ Increased speed is the biggest difference between Flarestorm and Flarestorm II.\nâ¢ This rubber has what an attacking pips player needs: low trajectory and fast speed\nâ¢ The hardness of the rubber sheet was designed for \"Close to the table\" and \"Controlled Stroke\" players."
    },
    {
        "r_name": "Butterfly Flextra",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-flextra",
        "r_spin": "87",
        "r_speed": "82",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-flextra.jpg?8",
        "r_description_1": "Easy-To-Handle Rubber For Developing Players",
        "r_description_2": "A flexible topsheet on a soft sponge produces good spin with moderate speed and exceptional control."
    },
    {
        "r_name": "Butterfly Impartial XB",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-impartial-xb",
        "r_spin": "67",
        "r_speed": "119",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-impartial-xb.jpg?8",
        "r_description_1": "In Pursuit Of The Balance Between Attacking And Defense",
        "r_description_2": "â¢ A High Tension pips-out rubber poised between passive and aggressive play\nâ¢ Impartial XB s recommended for the steady defensive minded player that will not hesitate to seize the attack!\nâ¢ The use of High Tension Technology adds more tension to the rubber surface providing increased speed and power\nâ¢ The soft sponge layer helps provide a solid foundation of control\nâ¢ The new Impartial rubbers are Butterfly's fastest pips-out rubber sheets"
    },
    {
        "r_name": "Butterfly Impartial XS",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-impartial-xs",
        "r_spin": "79",
        "r_speed": "122",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-impartial-xs.jpg?8",
        "r_description_1": "Enables Powerful Topspin Plays",
        "r_description_2": "â¢ A High Tension pips-out rubber that produces heavy spin and powerful drives\nâ¢ Impartial XS is recommended for players who want the maximum speed and spin from their pips\nâ¢ In addition to the High Tension, the pimple structure makes it easy to impart sharp topspin loops\nâ¢ For the most demanding pips-out player, Impartial offers the most speed and spin in Butterfly's line\nâ¢ âBryce-speedâ and âSriver-spinâ...in a pips-out rubber!"
    },
    {
        "r_name": "Butterfly Raystorm",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-raystorm",
        "r_spin": "70",
        "r_speed": "97",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-raystorm.jpg?8",
        "r_description_1": "High Tension Pimples-Out With High Elasticity And Spin",
        "r_description_2": "â¢ Softer pimples give more spin but are often not fast enough.\nâ¢ This has been overcome via High Tension technology, which adds enormous tension within the rubber's molecular structure.\nâ¢ Raystorm provides great control & great spin, while the High Tension adds that speed you've missed."
    },
    {
        "r_name": "Butterfly Roundell",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-roundell",
        "r_spin": "102",
        "r_speed": "128",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-roundell.jpg?8",
        "r_description_1": "Fulfill Your Potential",
        "r_description_2": "â¢ Roundell... The Next Step Towards Greatness.\nâ¢ Gives you good control for the amount of speed and spin that can be produced due to the very flexible top sheet and sponge."
    },
    {
        "r_name": "Butterfly Rozena",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-rozena",
        "r_spin": "108",
        "r_speed": "130",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-rozena.jpg?8",
        "r_description_1": "High Performance Rubber Rozena Developed in the Pursuit of 'Tolerance'",
        "r_description_2": "â¢ Rozena employs the rose-dyed Spring Sponge technology as its name suggests\nâ¢ The newly developed top sheet utilizes High Tension technology\nâ¢ With sufficient power, Rozena helps compensate for subtle racket angles and directional swing errors, creating a sense of stability\nâ¢ A rubber of high tolerance!\nâ¢ Rozena, improves your play through âforgivenessâ and is recommended for players aiming for the top"
    },
    {
        "r_name": "Butterfly Sapphira",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-sapphira",
        "r_spin": "85",
        "r_speed": "87",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-sapphira.jpg?8",
        "r_description_1": "Easy-To-Handle Rubber For Attack",
        "r_description_2": "â¢ A rubber for controlled offensive strokes.\nâ¢ Sapphira is an all-round rubber that makes your offensive strokes more powerful.\nâ¢ A wide range of players, from beginners to veterans, will find Sapphira an advanced rubber for the modern all-round strategy."
    },
    {
        "r_name": "Butterfly Speedy P.O.",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-speedy-po",
        "r_spin": "60",
        "r_speed": "100",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-speedy-po.jpg?8",
        "r_description_1": "Well-Balanced Pimples-Out With An Ideal Parabola",
        "r_description_2": "High quality pips-out rubber produced in close cooperation with Butterfly's elite players."
    },
    {
        "r_name": "Butterfly Spin Art",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-spin-art",
        "r_spin": "115",
        "r_speed": "119",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-spin-art.jpg?8",
        "r_description_1": "High Friction High Tension Rubber With Strengthened Bounce",
        "r_description_2": "Spring Spong technology combined with a hard sponge and a sticky top-sheet make this a very dynamic rubber."
    },
    {
        "r_name": "Butterfly Sriver",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-sriver",
        "r_spin": "80",
        "r_speed": "100",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-sriver.jpg?8",
        "r_description_1": "The World's Longtime Seller",
        "r_description_2": "â¢ Butterfly's most successful rubber since its introduction in 1967.\nâ¢ More than 20 World & 70 European titles have been won with Sriver.\nâ¢ A hard & tacky surface and medium hard & flexible sponge makes it the best choice for all-round attackers.\nâ¢ Its consistency proves it's the all-time winner."
    },
    {
        "r_name": "Butterfly Sriver EL",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-sriver-el",
        "r_spin": "80",
        "r_speed": "100",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-sriver-el.jpg?8",
        "r_description_1": "SRIVER with Instant Power and Control",
        "r_description_2": "Sriver EL combines Sriver's top sheet with a medium-soft elastic sponge."
    },
    {
        "r_name": "Butterfly Sriver FX",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-sriver-fx",
        "r_spin": "80",
        "r_speed": "100",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-sriver-fx.jpg?8",
        "r_description_1": "SRIVER With Outstanding Stability",
        "r_description_2": "Sriver FX combines the traditional Sriver rubber surface with a softer, more elastic sponge layer."
    },
    {
        "r_name": "Butterfly Super Anti",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-superanti",
        "r_spin": "30",
        "r_speed": "40",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-superanti.jpg?8",
        "r_description_1": "Anti Rubber To Toss Opponents",
        "r_description_2": "Super Anti has an exceptionally low friction topsheet designed to produce a no-spin ball."
    },
    {
        "r_name": "Butterfly Tackifire C",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-tackifire-c",
        "r_spin": "110",
        "r_speed": "85",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-tackifire-c.jpg?8",
        "r_description_1": "A Lot of Spin by the Highly Tacky Surface",
        "r_description_2": "The most notable trait of Tackifire C is it's tacky surface, which makes you think of a Chinese rubber."
    },
    {
        "r_name": "Butterfly Tackifire Drive",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-tack-d",
        "r_spin": "92",
        "r_speed": "90",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-tack-d.jpg?8",
        "r_description_1": "Well-Balanced Friction Rubber",
        "r_description_2": "â¢ Combination of an elastic sponge formula with a tacky and extra soft top sheet provides more power for attack and easier ball control.\nâ¢ Tackifire Drive provides a frightening volume of topspin for consistent loop drives.\nâ¢ Heavy backspin for defensive and service play."
    },
    {
        "r_name": "Butterfly Tackiness Chop II",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-tack-chop-ii",
        "r_spin": "100",
        "r_speed": "75",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-tack-chop-ii.jpg?8",
        "r_description_1": "Friction Rubber Good at Spinning",
        "r_description_2": "This is the advanced version of Tackiness Chop, which has been popular among choppers for years."
    },
    {
        "r_name": "Butterfly Tackiness Drive",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-tac-drive",
        "r_spin": "90",
        "r_speed": "85",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-tac-drive.jpg?8",
        "r_description_1": "Friction Rubber for Wide Range of Players",
        "r_description_2": "Designed for the controlled spin player, Tackiness Drive is equally at home for the steady looper or blistering chopper looking for more speed in his/her attack."
    },
    {
        "r_name": "Butterfly Tenergy 05",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-tenergy-05",
        "r_spin": "115",
        "r_speed": "130",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-tenergy-05.jpg?8",
        "r_description_1": "TENERGY: Excellent for Imparting Spin on the Ball",
        "r_description_2": "TENERGY 05 has a unique feeling using a combination of Spring Sponge technology, High Tension rubber and a tacky surface. It is excellent for imparting a great deal of spin on the ball. 05 in the name was adopted from Pimples Code No. 5. Tenergy 05 enables a full range of topspin play at or away from the table. It keeps its explosive power throughout the life of the rubber without the use of speed glue or boosting. Tenergy 05 is very popular among world-class table tennis players. European Champion Timo Boll uses Tenergy 05 on forehand and backhand."
    },
    {
        "r_name": "Butterfly Tenergy 05 Hard",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-tenergy-05-hard",
        "r_spin": "115",
        "r_speed": "130",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-tenergy-05-hard.jpg?8",
        "r_description_1": "Tenergy 05 Hard has adopted a stiffer sponge to add further power to the original Tenergy 05 rubber.",
        "r_description_2": "While it still maintains the incredible âSpring Spongeâ feel, the hard sponge responds to a stronger impact enabling more power."
    },
    {
        "r_name": "Butterfly Tenergy 05-FX",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-tenergy-05-fx",
        "r_spin": "115",
        "r_speed": "130",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-tenergy-05-fx.jpg?8",
        "r_description_1": "TENERGY: Topspin and Control",
        "r_description_2": "â¢ Tenergy 05 announced the arrival of Spring Sponge Technology!\nâ¢ Top international players around the world embraced this new development and the masses followed\nâ¢ The Tenergy Family of rubbers evolved allowing all styles of play to benefit from this new Technology\nâ¢ Spring Sponge is produced by the unique format of air bubbles within the sponge and the thin pimples of the highly flexible surface, enabling dynamic topspin play with heavy rotation.\nâ¢ Tenergy 05-FX offers the same top-sheet as Tenergy 05, but with a softer sponge layer and is best-suited for offensive all-round play."
    },
    {
        "r_name": "Butterfly Tenergy 25",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-tenergy-25",
        "r_spin": "110",
        "r_speed": "132",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-tenergy-25.jpg?8",
        "r_description_1": "TENERGY: Excellent for Attacking and Controlled Play near the Table",
        "r_description_2": "â¢ Powered by Spring Sponge Technology and with pimples of a larger diameter than other rubbers, Tenergy 25 creates dynamic attacks for close-to-the-table play.\nâ¢ Spring Sponge Technology is produced by the unique format of air bubbles within the sponge and the thin pimples of the highly flexible surface, enable dynamic topspin play with heavy rotation.\nâ¢ Adept at drop-shots, flicks, short pushes and quick counter attacks, Tenergy 25 is perfect for close-to-the table play.\nâ¢ Within the Tenergy Family of rubbers, all styles of play can benefit from this new technology"
    },
    {
        "r_name": "Butterfly Tenergy 25-FX",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-tenergy-25-fx",
        "r_spin": "110",
        "r_speed": "132",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-tenergy-25-fx.jpg?8",
        "r_description_1": "TENERGY: for Power and Control",
        "r_description_2": "â¢ Powered by Spring Sponge Technology and with pimples of a larger diameter than other rubbers, Tenergy 25 creates dynamic attacks for close-to-the-table play.\nâ¢ Spring Sponge Technology is produced by the unique format of air bubbles within the sponge and the thin pimples of the highly flexible surface, enable dynamic topspin play with heavy rotation.\nâ¢ Tenergy 25-FX combines the same top-sheet of Tenergy 25 with a softer sponge layer and is adept at drop-shots, flicks, short pushes and quick counter attacks, making it perfect for close-to-the table play.\nâ¢ Within the Tenergy Family of rubbers, all styles of play can benefit from this new technology"
    },
    {
        "r_name": "Butterfly Tenergy 64",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-tenergy-64",
        "r_spin": "105",
        "r_speed": "135",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-tenergy-64.jpg?8",
        "r_description_1": "TENERGY: The Speed Effect",
        "r_description_2": "â¢ Powered by Spring Sponge Technology and with more distance between the pimples, Tenergy 64 is the fastest of the Tenergy rubbers and offers more flexibility and a softer touch, enabling powerful and precise attacking strokes from mid distance.\nâ¢ Spring Sponge Technology is produced by the unique format of air bubbles within the sponge and the thin pimples of the highly flexible surface, enable dynamic topspin play with heavy rotation.\nâ¢ With the most speed among the Tenergy rubbers, Tenergy 64 is the ultimate attacking rubber.\nâ¢ Within the Tenergy Family of rubbers, all styles of play can benefit from this new technology\nâ¢ Which Tenergy is right for you?"
    },
    {
        "r_name": "Butterfly Tenergy 64-FX",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-tenergy-64-fx",
        "r_spin": "105",
        "r_speed": "135",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-tenergy-64-fx.jpg?8",
        "r_description_1": "TENERGY: Speed and Control",
        "r_description_2": "â¢ Similar to Tenergy 64, but a softer sponge layer, Tenergy 64-FX is the ultimate attacking rubber for players who prefer a softer feel at impact.\nâ¢ Powered by Spring Sponge Technology and with more distance between the pimples, Tenergy 64 is the fastest of the Tenergy rubbers and offers more flexibility and a softer touch, enabling powerful and precise attacking strokes from mid distance.\nâ¢ Spring Sponge Technology is produced by the unique format of air bubbles within the sponge and the thin pimples of the highly flexible surface, enable dynamic topspin play with heavy rotation.\nâ¢ Within the Tenergy Family of rubbers, all styles of play can benefit from this new technology\nâ¢ Which Tenergy is right for you?!"
    },
    {
        "r_name": "Butterfly Tenergy 80",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-tenergy-80",
        "r_spin": "112",
        "r_speed": "132",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-tenergy-80.jpg?8",
        "r_description_1": "TENERGY: Ideal Balance between Spin and Speed",
        "r_description_2": "â¢ Tenergy 80 is the ideal balance between spin and speed\nâ¢ Even faster than Tenergy 05 and offering the same speed as Tenergy 25\nâ¢ Tenergy 80 enables all-round topspin play, attack and counterattack regardless of your playing style\nâ¢ Several top players have already made the switch to Tenergy 80\nâ¢ Tenergy Family Rubbers, realize your more!"
    },
    {
        "r_name": "Butterfly Tenergy 80-FX",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-tenergy-80-fx",
        "r_spin": "112",
        "r_speed": "132",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-tenergy-80-fx.jpg?8",
        "r_description_1": "TENERGY: Ideal Balance between Spin and Speed with Control",
        "r_description_2": "â¢ Tenergy 80-FX - the ideal balance between spin and speed now in a softer sponge\nâ¢ Ideal rubber for all-round attackers and mid-distance loopers\nâ¢ Looking for more control? The touch in the short game is among the best in the Tenergy series!\nâ¢ Easier to return serves, block and loop against backspin\nâ¢ Tenergy Family, realize your more!"
    },
    {
        "r_name": "DHS Gold Arc 8 - 47.5 Hardness",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-gold-arc-8",
        "r_spin": "94",
        "r_speed": "93",
        "r_control": "69",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-gold-arc-8.jpg?8",
        "r_description_1": "The rubber surface of GOLDARC 8 is highly elastic just like a fully bent bow, which can easily create strong friction. This smooth surface rubber with underlying intensive big-pimple structure gives the rubber great elasticity and off-court power. The player can enjoy the instant feeling of striking with minimal effort and will appreciate the crisp hitting sound.",
        "r_description_2": "GOLDARC 8 has outstanding performance in strength and speed, bringing an overwhelming pressure to the opponent in full court. This rubber is suitable for both forehand and backhand."
    },
    {
        "r_name": "DHS Gold Arc 8 - 50 Hardness",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-gold-arc-8-50",
        "r_spin": "94",
        "r_speed": "93",
        "r_control": "69",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-gold-arc-8-50.jpg?8",
        "r_description_1": "The rubber surface of GOLDARC 8 is highly elastic just like a fully bent bow, which can easily create strong friction. This smooth surface rubber with underlying intensive big-pimple structure gives the rubber great elasticity and off-court power. The player can enjoy the instant feeling of striking with minimal effort and will appreciate the crisp hitting sound.",
        "r_description_2": "GOLDARC 8 has outstanding performance in strength and speed, bringing an overwhelming pressure to the opponent in full court. This rubber is suitable for both forehand and backhand."
    },
    {
        "r_name": "DHS Hurricane 2 Neo",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-h2-neo",
        "r_spin": "120",
        "r_speed": "120",
        "r_control": "100",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-h2-neo.jpg?8",
        "r_description_1": "The Explosive NEO series is here!",
        "r_description_2": "The new NEO Rubbers have been produced for, and tested by, the Chinese National team to counteract the Speed Glue ban.  The new NEO sponge has been developed to give the traditional sticky DHS rubbers the extra pace & rebound but without losing the much loved spin and control.  With this NEW NEO Sponge, Hurricane 2 is quicker than before yet retains its legendary balance of speed, spin and control.  Comes in an air-tight pack to keep good longer."
    },
    {
        "r_name": "DHS Hurricane 3 National",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-h3-n",
        "r_spin": "n/a",
        "r_speed": "n/a",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-h3-n.jpg?8",
        "r_description_1": "National Level Limited Product DHS Hurricane 3 NATIONAL Version (Orange Sponge) - BEST OF THE BEST Quality Hurricane 3 III - Supply to China National Team Player\n\n- 39 Degrees\n- Orange Sponge",
        "r_description_2": "Rubber FAQ and Guide - what you need to know when buying rubber sheets."
    },
    {
        "r_name": "DHS Hurricane 3 Neo",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-h3-neo",
        "r_spin": "120",
        "r_speed": "120",
        "r_control": "100",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-h3-neo.jpg?8",
        "r_description_1": "H3 Neo is good for fast topspin quick attack play style.",
        "r_description_2": "The Explosive NEO series is here!"
    },
    {
        "r_name": "DHS Hurricane 3 Neo Provincial",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-h3-neo-provincial",
        "r_spin": "n/a",
        "r_speed": "n/a",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-h3-neo-provincial.jpg?8",
        "r_description_1": "A higher quality version of Hurricane 3 Neo. With the Provincial version, you can expect a dramatic increase in spin, control, and speed. Everything you enjoy from the original Hurricane 3 Neo has been amplified by a great margin.",
        "r_description_2": "Hardness: 39 degrees (this is not shown on the package)"
    },
    {
        "r_name": "DHS Hurricane 3 Provincial - Blue Sponge",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-h3-provincial-blue",
        "r_spin": "n/a",
        "r_speed": "n/a",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-h3-provincial-blue.jpg?8",
        "r_description_1": "",
        "r_description_2": "A higher quality version of Hurricane 3. With the Provincial version, you can expect a dramatic increase in spin, control, and speed. Everything you enjoy from the original Hurricane 3 has been amplified by a great margin. High quality blue sponge version with 40 degree hardness."
    },
    {
        "r_name": "DHS Hurricane 3 Provincial - Yellow Spon...",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-h3-p",
        "r_spin": "n/a",
        "r_speed": "n/a",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-h3-p.jpg?8",
        "r_description_1": "Provincial team level Hurricane 3 orange sponge. Simply the best Provincial Rubber for players who are looking for the extreme weapon.",
        "r_description_2": "â¢ 39 Degrees\nâ¢ Orange Sponge"
    },
    {
        "r_name": "DHS Hurricane 3-50 Soft",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-hurricane-3-50",
        "r_spin": "92",
        "r_speed": "90",
        "r_control": "73",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-hurricane-3-50.jpg?8",
        "r_description_1": "Hurricane 3-50 is a tacky rubber which produces a characteristic low arcing ball flight from middle distance. The underlying 50# sponge is produced with great sponge elasticity which enables and maximises a strong spin effect with use of the wrist. Hurricane 3-50 is the first choice for players who prefer to drive-loop and topspin. It integrates tacky rubber with elastic sponge. The sponge is receptive to ball contact while the rubber friction grips and holds the ball. Such a combination provides the player with great ball feeling with every shot and suits players who want to exert a fast, stable loop attack. Now available in soft edition!",
        "r_description_2": "Hardness: 35 degrees\nSpeed: 90\nSpin: 92\nControl: 73"
    },
    {
        "r_name": "DHS Hurricane 8 Mid",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-h-80-mid",
        "r_spin": "98",
        "r_speed": "92",
        "r_control": "74",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-h-80-mid.jpg?8",
        "r_description_1": "Hurricane 8 is a new generation of sticky-speed rubber. The rubber keeps a good balance between flexibility and elasticity. A new high-density sponge with 'Macro-Cell' and 'High-Elasticity Particle Osmosis' technology helps Hurricane 8 raise the elasticity by 15%. The player can also acquire a high shot speed with weak attack.",
        "r_description_2": "Hurricane 8 provides unique spin and unpredictable arc and enhances shot speed significantly, which brings a refreshing feeling for offensive players."
    },
    {
        "r_name": "DHS Skyline 3-60 - Mid-Hard",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-skyline-3-60",
        "r_spin": "95",
        "r_speed": "86",
        "r_control": "70",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-skyline-3-60.jpg?8",
        "r_description_1": "CONTROL + LOOP Sticky Rubber + Soft Elastic Sponge Skyline 3-60: classic sticky rubber + new soft elastic sponge Classic Skyline 3, equipped with a soft and elastic 60 sponge, brings a unique sense of depth with ball contact. Skyline 3-60 is designed with a unique sponge-rubber combination. It absorbs and responds rapidly on ball contact, providing for excellent elasticity and speed. Such dynamic properties make Skyline 3-60 ideal for continuous and high strength loop attacks. Minimal effort is needed. The soft elastic 60 sponge and pliable rubber is perfect for making fast attacks and subtle technical changes with the wrist, to deceive the opponent. Skyline 3-60 generates strong and changeable spin. Supported by soft elastic sponge, the sticky rubber optimises such spin potential. Players using Skyline 3-60 will not be limited to one certain type of loop but have the option of making varied loop techniques. Skyline 3-60 is the optimal combination of classic sticky rubber and elastic sponge.",
        "r_description_2": "Hardness: 37 degrees\nSpeed: 86\nSpin: 95\nControl: 70"
    },
    {
        "r_name": "DHS Skyline 3-60 - Mid-Soft",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-skyline-3-60-mid-soft",
        "r_spin": "95",
        "r_speed": "86",
        "r_control": "70",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-skyline-3-60-mid-soft.jpg?8",
        "r_description_1": "CONTROL + LOOP Sticky Rubber + Soft Elastic Sponge Skyline 3-60: classic sticky rubber + new soft elastic sponge Classic Skyline 3, equipped with a soft and elastic 60 sponge, brings a unique sense of depth with ball contact. Skyline 3-60 is designed with a unique sponge-rubber combination. It absorbs and responds rapidly on ball contact, providing for excellent elasticity and speed. Such dynamic properties make Skyline 3-60 ideal for continuous and high strength loop attacks. Minimal effort is needed. The soft elastic 60 sponge and pliable rubber is perfect for making fast attacks and subtle technical changes with the wrist, to deceive the opponent. Skyline 3-60 generates strong and changeable spin. Supported by soft elastic sponge, the sticky rubber optimises such spin potential. Players using Skyline 3-60 will not be limited to one certain type of loop but have the option of making varied loop techniques. Skyline 3-60 is the optimal combination of classic sticky rubber and elastic sponge.",
        "r_description_2": "Hardness: 35 degrees\nSpeed: 86\nSpin: 95        \nControl: 70"
    },
    {
        "r_name": "DHS TG Skyline 2",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-skyline-2",
        "r_spin": "110",
        "r_speed": "90",
        "r_control": "100",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "DHS Skyline 2 (control + spin) Skyline 2 rubber made with new technique brings fresh experience of loop with quick-attack. Colloid combined with acerbity and glutinosity has distinguished friction, which is completely different from Chinese traditional rubbers and can create powerful and changeable spin, Power and energy would break out continually for unique pimple structure and elastic colloid so that changeful spin is more steady and threatening.\n \nHardness: 40 degrees",
        "r_description_2": "Speed:90\nSpin:110\nControl:100"
    },
    {
        "r_name": "DHS TG Skyline 2 Neo",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-skyline-2-neo",
        "r_spin": "100",
        "r_speed": "90",
        "r_control": "110",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-skyline-2-neo.jpg?8",
        "r_description_1": "DHS Skyline 2 (control + spin) Skyline 2 rubber made with new technique brings fresh experience of loop with quick-attack. Colloid combined with acerbity and glutinosity has distinguished friction, which is completely different from Chinese traditional rubbers and can create powerful and changeable spin, Power and energy would break out continually for unique pimple structure and elastic colloid so that changeful spin is more steady and threatening.\n \nSpeed: 90\t\nSpin: 100\nControl: 110",
        "r_description_2": "Rubber FAQ and Guide - what you need to know when buying rubber sheets."
    },
    {
        "r_name": "DHS TG Skyline 3 Neo",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-skyline-3-neo",
        "r_spin": "120",
        "r_speed": "120",
        "r_control": "110",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-skyline-3-neo.jpg?8",
        "r_description_1": "TG3 Neo is good for mid-distance looping attack play style.",
        "r_description_2": "These new and improved TG3s are designed specifically for the new VOC-Free glue era."
    },
    {
        "r_name": "DHS TinArc 3 - Mid-Hard",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-tinarc-3-mh",
        "r_spin": "88",
        "r_speed": "87",
        "r_control": "74",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-tinarc-3-mh.jpg?8",
        "r_description_1": "TinArc 3's pimple structure is specially designed for buffering and absorbing energy. This makes the rubber perform excellent in ball control and creates varying spin close to the table and generates power from mid to far distance. TinArc 3 incorporates 'Dual-Extreme' technology in rubber and sponge and is preferred by top players who play with loop and control drives.",
        "r_description_2": "Hardness: 37\nSpeed: 87\t\nSpin: 88\t\nControl:74"
    },
    {
        "r_name": "DHS TinArc 3 - Soft",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-tinarc-3",
        "r_spin": "88",
        "r_speed": "87",
        "r_control": "76",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-tinarc-3.jpg?8",
        "r_description_1": "DHS TinArc 3's pimple structure is specially designed for buffering and absorbing energy. This makes the rubber perform excellent in ball control and creates varying spin close to the table and generates power from mid to far distance. TinArc 3 incorporates 'Dual-Extreme' technology in rubber and sponge and is preferred by top players who play with loop and control drives.",
        "r_description_2": "Hardness: 35 degrees\nSpeed: 87\nSpin: 88 \nControl: 76"
    },
    {
        "r_name": "DHS Tinarc 5 - Mid-Hard",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-tinarc-5-mh",
        "r_spin": "96",
        "r_speed": "98",
        "r_control": "74",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-tinarc-5-mh.jpg?8",
        "r_description_1": "",
        "r_description_2": "TinArc 5 combines both great feeling with elasticity allowing for powerful stroke execution. TinArc 5 rubber allows the ball to rebound rapidly with a soft sponge and a highly elastic topsheet, ideal for feel with quick loops, ball handling near the net, or off-court play. This outstanding elastic rubber with thicker pimple design beneath the topsheet enables strong power with minimal effort. The new sponge also uses MACRO-CELL & High-Elasticity Particle Osmosis technology, providing powerful attacking capabilities. TinArc 5 is specially designed to enhance the speed of 40+ celluloid-free T.T. balls and is suitable for continuous offensive play."
    },
    {
        "r_name": "DHS TinArc 5 - Soft",
        "link": "https://www.megaspin.net/store/default.asp?pid=dhs-tinarc-5",
        "r_spin": "94",
        "r_speed": "96",
        "r_control": "74",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_dhs-tinarc-5.jpg?8",
        "r_description_1": "DHS TinArc 5 rubber combines both great feeling with powerful elastic shots. The rubber allows the ball to absorb and penetrate easily, ideal for feel with quick loops, ball handling near the net, or off-court play. The outstanding elastic rubber and thick pimple design, which has quick rebound on ball strikes, enables strong power with minimal effort. The new sponge also uses 'MACRO-CELL' and 'High-Elasticity Particle Osmosis' technology, providing powerful attack.",
        "r_description_2": "TinArc 5 is suitable for continuous quick loop with quick attack drive, and specially designed to enhance the speed of 40+ balls."
    },
    {
        "r_name": "Donic Acuda Blue P1",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-acuda-blue-p1",
        "r_spin": "104",
        "r_speed": "102",
        "r_control": "69",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-acuda-blue-p1.jpg?8",
        "r_description_1": "For all out attackers, a pleasure to play with, a rubber to be at ease with.",
        "r_description_2": "The latest in sponge technology. This blue sponge with medium sized pores is softer than previous sponges, despite having a higher degree of hardness. A new pimple geometry, thin long pimples with extra space between individual pimples."
    },
    {
        "r_name": "Donic Acuda Blue P1 Turbo",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-acuda-p1-turbo",
        "r_spin": "108",
        "r_speed": "106",
        "r_control": "70",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-acuda-p1-turbo.jpg?8",
        "r_description_1": "An impressive result of the most modern technology. The Acuda Blue P1 Turbo offers greater speed whilst retaining its legendary control. All made possible by a unique new pimple formation. The P1 Turbo is the most dynamic and hardest rubber from the Acuda series. Since the distance between the pimples is wider and the pimples themselves are smaller, the rubber actually plays softer.",
        "r_description_2": "A packet of strength for the uncompromising attacker who expects optimum speed and power combined with an easy feel."
    },
    {
        "r_name": "Donic Acuda Blue P2",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-acuda-blue-p2",
        "r_spin": "106",
        "r_speed": "98",
        "r_control": "75",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-acuda-blue-p2.jpg?8",
        "r_description_1": "Medium soft, all-round attacking version, the gold standard version of an all-round rubber. For offensive and power all-round players, a pleasure to play with, a rubber to be at ease with. The latest in sponge technology. This blue sponge with medium sized pores is softer than previous sponges, despite having a higher degree of hardness.",
        "r_description_2": "A new pimple geometry, thin long pimples with extra space between individual pimples.\nThe latest generation in top surface rubber: grippy, as with Bluefire M1 Turbo and JP 01 Turbo but with slightly flatter ball arc."
    },
    {
        "r_name": "Donic Acuda Blue P3",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-acuda-blue-p3",
        "r_spin": "106",
        "r_speed": "90",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-acuda-blue-p3.jpg?8",
        "r_description_1": "Super soft, excellent control with satisfying sound.\nFor all-round players, a pleasure to play with, a rubber to be at ease with.",
        "r_description_2": "The latest in sponge technology. This blue sponge with medium sized pores is softer than previous sponges, despite having a higher degree of hardness. A new pimple geometry, thin long pimples with extra space between individual pimples. The latest generation in top surface rubber: grippy, as with Bluefire M1 Turbo and JP 01 Turbo but with slightly flatter ball arc. Ball return is excellent: Maximum control, a satisfying sound and so easy to play with. Fine touch ? suitable for every playing standard (depending on sponge thickness and degree of hardness)."
    },
    {
        "r_name": "Donic Acuda S1",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-acuda-s1",
        "r_spin": "97",
        "r_speed": "96",
        "r_control": "68",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-acuda-s1.jpg?8",
        "r_description_1": "Donic Acuda S1 is a very fast rubber with outstanding spin qualities. Close to or away from the table it is possible to play \"loop-loop\" as in the days of speed glued rubbers. Despite its medium-hard sponge, ACUDA S1 is easily controllable and has a great feel. You can count on ACUDA S1 even in an awkward situation. This rubber may be fast but ball control is excellent.",
        "r_description_2": "Basic character: spin-focused, high precision fast rubber. Player's style: aggressive, first ball attack, close to the table."
    },
    {
        "r_name": "Donic Acuda S1 Turbo",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-acuda-s1-turbo",
        "r_spin": "107",
        "r_speed": "107",
        "r_control": "60",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-acuda-s1-turbo.jpg?8",
        "r_description_1": "The Turbo version from the Acuda series is effective due to the maximum inbuilt speed glue effect which enhances speed and acceleration. The DONIC Acuda rubbers became an immediate worldwide success the moment they entered the market. In order to offer unbeatable rubber technology for the top players DONIC included Turbo in the manufacture of its bestseller Acuda S1 series. DONIC Acuda S1 Turbo is a precision rubber designed for accuracy at high speeds. Despite the rubber being dynamic and fast, it has perfect feel - reminiscent of earlier speed glue days. Thanks to highly developed technology this advanced rubber from the house of DONIC produces good length when playing fast loops and that despite a characteristic high arc. Characteristics: spinny, accurate top class rubber Recommended for: performance orientated attackers.",
        "r_description_2": "Speed: 107 \nSpin: 107 \nControl: 60"
    },
    {
        "r_name": "Donic Acuda S2",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-acuda-s2",
        "r_spin": "98",
        "r_speed": "92",
        "r_control": "69",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-acuda-s2.jpg?8",
        "r_description_1": "Donic Acuda S2 is a very fast rubber with outstanding spin qualities. Close to or away from the table it is possible to play \"loop-loop\" as in the days of speed glued rubbers. Despite its medium-hard sponge, ACUDA S1 is easily controllable and has a great feel. You can count on ACUDA S1 even in an awkward situation. This rubber may be fast but ball control is excellent. Basic character: spin-focused, high precision fast rubber. Player's style: aggressive, first ball attack, close to the table.",
        "r_description_2": "Type: Smooth \nSpeed: 92 \nSpin: 98 \nControl: 69 \nHardness: 42.5"
    },
    {
        "r_name": "Donic Acuda S3",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-acuda-s3",
        "r_spin": "100",
        "r_speed": "100",
        "r_control": "60",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-acuda-s3.jpg?8",
        "r_description_1": "As with the other rubbers from the ACUDA series, ACUDA S3 produces excellent spin. The very soft sponge increases feel and sound, and offers sufficient speed for powerful spin and a positive block game. Playing with DONIC ACUDA S3 will guarantee success and pleasure. It has a unique sound!Sponge hardness: softPlaying characteristics: spin-optimized, fast, paired with perfect sound.",
        "r_description_2": "Recommended for: Spin and allround players who require excellent control."
    },
    {
        "r_name": "Donic Baracuda",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-baracuda",
        "r_spin": "98",
        "r_speed": "91",
        "r_control": "71",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-baracuda.jpg?8",
        "r_description_1": "The rubber with vicious spin.",
        "r_description_2": "The new FORMULA DONIC BARACUDA rubber with inbuilt speed glue effect produces fantastic spin. With DONIC BARACUDA the ball leaves the blade in a conspicuously higher arc, giving considerably more spin. The increased rotation of the ball stabilises the flight and increases speed. The results are convincing after a few hours of training to become used to this modern rubber. Accuracy of placement is visibly improved even for top players."
    },
    {
        "r_name": "Donic Baracuda Big Slam",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-baracuda-bsl",
        "r_spin": "100",
        "r_speed": "90",
        "r_control": "73",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-baracuda-bsl.jpg?8",
        "r_description_1": "Even more sound and control due to the softer sponge.The new FORMULA DONIC BARACUDA BIG SLAM rubber with inbuilt speed glue effect produces fantastic spin. With DONIC BARACUDA BIG SLAM the ball leaves the blade in a conspicuously higher arc, giving considerably more spin. The increased rotation of the ball stabilises the flight and increases speed. The results are convincing after a few hours of training to become used to this modern rubber. Accuracy of placement is visibly improved even for top players. DONIC BARACUDA BIG SLAM offers that extra margin of safety even in the tightest situation, and not only when engaged in a high risk top spin game.DONIC BARACUDA BIG SLAM?s top rubber surface has been newly constructed to minimise abrasion. The happy result: more playing hours with a surface that remains intact without noticeable abrasion.",
        "r_description_2": "Speed: 90 \nSpin: 100 \nControl: 73"
    },
    {
        "r_name": "Donic Bluefire Big Slam",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-bluefire-bs",
        "r_spin": "106",
        "r_speed": "94",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-bluefire-bs.jpg?8",
        "r_description_1": "One never forgets that great love. For all those who loved and have never forgotten the sound of the old speed glue times, there is now the new Bluefire Big Slam. This extremely soft blue sponge produces more sound ? it really tocks! Added to this is a high grade grippy and spinny top surface rubber of the Bluefire series: The perfect combination. This rubber is now available in maximum, 2.0 and 1.8 mm thickness and additionally in 1.6 mm. This gives you even more control ? and an earful to your opponent.",
        "r_description_2": "Speed: 94 \nSpin: 106\nControl: 80"
    },
    {
        "r_name": "Donic Bluefire JP 01",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-bluefire-jp-01",
        "r_spin": "105",
        "r_speed": "102",
        "r_control": "70",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-bluefire-jp-01.jpg?8",
        "r_description_1": "â¢ The Japanese have influenced an outstanding rubber development \"Bluefire\" which DONIC have successfully incorporated in the production of Formula DONIC (FD3 3rd Generation) Technology. The result: Bluefire JP01 and Bluefire JP03.\nâ¢ This is a new type of pimpled rubber in combination with the proven, dynamic blue sponge but with a somewhat finer pored structure. This lends the rubber sensational feel, with maximum catapult and a very high arc of the ball. The very grippy, taut but elastic top surface rubber produces maximum spin when top-spinning and fantastic control due to increased contact on the bat.\nâ¢ BLUEFIRE JP is a very consistent rubber and suitable for most players. The quickest and hardest sponge version, BLUEFIRE JP 01 is especially recommended for close to the table attacking players as well as those who prefer to play away from the table. BLUEFIRE JP 03 with a softer sponge has excellent playing qualities with optimum control. The perfect alternative for attackers as well as -power-allround- players, who value maximum control to return the ball under pressure in any situation. Playing characteristics: Extremely grippy, taut, though elastic top surface rubber. Produces maximum spin when top-spinning and stays on the blade longer.\nâ¢ Recommended for close to the table attackers as well as for those who like to play away from the table.",
        "r_description_2": "Speed: 102\nSpin: 105\nControl: 70"
    },
    {
        "r_name": "Donic Bluefire JP 01 Turbo",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-bluefire-jp-01-t",
        "r_spin": "98",
        "r_speed": "97",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-bluefire-jp-01-t.jpg?8",
        "r_description_1": "Bluefire JP is now available in the top quality TURBO version. The Bluefire JP 01 Turbo is more explosive than ever! Small changes to the structure of the sponge combined with a new pimple formation ensures that this TURBO rubber has enhanced dynamic and spin qualities. Bluefire JP 01 Turbo is an outstanding upgrade to the Bluefire JP 01 rubber. The open-pored sponge has similar sponge hardness to JP 01, with increased dynamic that is easily controlled. Medium+ sponge hardness, and spin-elastic top surface. Bluefire JP 01 Turbo is great for attackers who value good control. Playing with this rubber is a dream come true!",
        "r_description_2": "Speed: 97\t \nSpin: 98\t \nControl: 67"
    },
    {
        "r_name": "Donic Bluefire JP 03",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-bluefire-jp-03",
        "r_spin": "105",
        "r_speed": "95",
        "r_control": "65",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-bluefire-jp-03.jpg?8",
        "r_description_1": "â¢ The Japanese have influenced an outstanding rubber development \"Bluefire\" which DONIC have successfully incorporated in the production of Formula DONIC (FD3 3rd Generation) Technology. The result:  Bluefire JP01 and Bluefire JP03.\nâ¢ This is a new type of pimpled rubber in combination with the proven, dynamic blue sponge but with a somewhat finer pored structure. This lends the rubber sensational feel, with maximum catapult and a very high arc of the ball. The very grippy, taut but elastic top surface rubber produces maximum spin when top-spinning and fantastic control due to increased contact on the bat. BLUEFIRE JP is a very consistent rubber and suitable for most players. The quickest and hardest sponge version, BLUEFIRE JP 01 is especially recommended for close to the table attacking players as well as those who prefer to play away from the table.\nâ¢ BLUEFIRE JP 03 with a softer sponge has excellent playing qualities with optimum control. The perfect alternative for attackers as well as -power-allround- players, who value maximum control to return the ball under pressure in any situation.\nDONIC Bluefire JP 03\nPlaying characteristics: Extremely grippy, taut, though elastic top surface rubber combined with a softer sponge. Ensures outstanding feeling with maximum control. \nâ¢ Recommended for attackers as well as power-allround players who require maximum control to return the ball under pressure in any situation.",
        "r_description_2": "Speed: 95 \t \nSpin: 105\nControl: 65"
    },
    {
        "r_name": "Donic Bluefire M1",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-bluefire-m1",
        "r_spin": "107",
        "r_speed": "107",
        "r_control": "60",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-bluefire-m1.jpg?8",
        "r_description_1": "Donic Bluefire M1",
        "r_description_2": "Characteristics: highly dynamic, extremely spinny top sheet Recommended for: top players or players who practice a lot and prefer to use harder rubbers.\nThe blue miracle."
    },
    {
        "r_name": "Donic Bluefire M1 Turbo",
        "link": "https://www.megaspin.net/store/default.asp?pid=b-bluefire-m1-t",
        "r_spin": "98",
        "r_speed": "98",
        "r_control": "66",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_b-bluefire-m1-t.jpg?8",
        "r_description_1": "Bluefire M1 is now available in the top quality TURBO version. The Bluefire M1 Turbo is more explosive than ever! Small changes to the structure of the sponge combined with a new pimple formation ensures that this TURBO rubber has enhanced dynamic and spin qualities. Bluefire M1 Turbo is an outstanding upgrade to the Bluefire M1 rubber. Slightly harder sponge (medium ++) than the Bluefire M1, with a spin-elastic top surface rubber that offers extra spin. Bluefire M1 Turbo is great for aggressive attacking players. Playing with this rubber is an attacker's dream come true!",
        "r_description_2": "Speed: 98\t \nSpin: 98\t \nControl: 66"
    },
    {
        "r_name": "Donic Bluefire M2",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-bluefire-ms2",
        "r_spin": "107",
        "r_speed": "97",
        "r_control": "70",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-bluefire-ms2.jpg?8",
        "r_description_1": "DONIC Bluefire M2",
        "r_description_2": "Characteristics: Excellent balance between speed, catapult effect and feel. Recommended for: Players who like to play with Medium Hard rubbers and attach high importance to spin and speed with optimum feeling."
    },
    {
        "r_name": "Donic Bluefire M3",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-bluefire-ms3",
        "r_spin": "107",
        "r_speed": "90",
        "r_control": "77",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-bluefire-ms3.jpg?8",
        "r_description_1": "Donic Bluefire M3",
        "r_description_2": "Characteristics: Perfect adjustment of the soft version with precise feel, excellent spin and perfect sound. Recommended for: Players that prefer soft rubbers with perfect control and good speed. Also for aggressive all-round players."
    },
    {
        "r_name": "Donic BlueGrip R1",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-bluegrip-r1",
        "r_spin": "97",
        "r_speed": "94",
        "r_control": "68",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-bluegrip-r1.jpg?8",
        "r_description_1": "Donic BlueGrip -- The Return of Rotation! \nDonic presents a real innovation: the answer to the plastic ball. BlueGrip is the first rubber that has a sticky, Chinese-style surface combined with a sponge with built-in speed glue effect. BlueGrip combines the best of two worlds - plus it is \"Made in Germany\"! Our developers have been asking themselves: how can you compensate for the rotation loss that the plastic ball has brought, but without sacrificing the dynamics of coatings with built-in speed glue effect? The result is BlueGrip. \n \nBlueGrip R1 has a blue, medium-pored sponge that provides a powerful catapult effect and a surface that optimally supports both sides attacking game. BlueGrip R1 gives a slightly softer feel and compensates for the losses that the plastic ball has brought with it. The longer contact time at the ball meeting point allows significantly more rotation in the up and back play. Plus it is \"Made in Germany\"!",
        "r_description_2": "BlueGrip R1 is the future: Play as before, thanks to the technology of tomorrow."
    },
    {
        "r_name": "Donic BlueGrip V1",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-bluegrip-v1",
        "r_spin": "n/a",
        "r_speed": "n/a",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-bluegrip-v1.jpg?8",
        "r_description_1": "Donic BlueGrip -- The Return of Rotation! \n\nDonic presents a real innovation: the answer to the plastic ball. BlueGrip is the first rubber that has a sticky, Chinese-style surface combined with a sponge with built-in speed glue effect. BlueGrip combines the best of two worlds - plus it is \"Made in Germany\"! Our developers have been asking themselves: how can you compensate for the rotation loss that the plastic ball has brought, but without sacrificing the dynamics of coatings with built-in speed glue effect? The result is the BlueGrip. \n \nBlueGrip V1 has a sticky topsheet with Chinese orientation in combination with a fine-pored, dynamic sponge. It is particularly well suited for topspin players who prefer to attack with the forehand, thanks to its sticky surface, but is also suitable for material players and defenders who occasionally like to topspin from half-distance. \n\nThe BlueGrip V1 follows the Chinese trend: Success in Style!\n\nSpeed:92 \nSpin:98 \nControl:68\nHardness: Hard",
        "r_description_2": "Rubber FAQ and Guide - what you need to know when buying rubber sheets."
    },
    {
        "r_name": "Donic Bluestorm Big Slam",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-bluestorm-bs",
        "r_spin": "n/a",
        "r_speed": "n/a",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-bluestorm-bs.jpg?8",
        "r_description_1": "Donic Bluestorm Big Slam: The Sound Machine! With middle pored sponge, new lighter sponge technology, and a 42.5Â° sponge, this is Bluestormâs softest variation. Bluestorm Big Slam is the fifth version, completing the Bluestorm series. For players who like the speed glue sound of earlier days, this is the soft variation and a great alternative. The extremely thin high tension top surface rubber, in combination with a new lighter sponge technology, ensures the best-ever feel.\n\nBLUE ALERT! \nA comprehensively thinner top surface rubber, subjected to high tension, allows space for a thicker sponge - generating extra power and speed. The DONIC Bluestorm Series offers noticeably greater acceleration while retaining its outstanding spin and speed characteristics. The thinnest sponge is 1.9mm, middle sponge thickness is 2.1mm, and the thickest variation is called max+ because this sponge is even thicker than previous max versions.\n\nSpeed: 88 \nSpin: 97 \nControl: 74",
        "r_description_2": "Rubber FAQ and Guide - what you need to know when buying rubber sheets."
    },
    {
        "r_name": "Donic Bluestorm Z1",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-bluestorm-z1",
        "r_spin": "97",
        "r_speed": "97",
        "r_control": "69",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-bluestorm-z1.jpg?8",
        "r_description_1": "Donic Bluestorm Z1: A LIGHTNING STRIKE!",
        "r_description_2": "Bluestorm Z1 with its medium pored sponge and a short, wide pimple structure is the hardest and fastest of the three Bluestorm versions. It has immense power. However, in order to engage with so much horse power, a competent driver is required behind the wheel. A well trained player, master of the fastest game, will find Z1 to be a lethal weapon."
    },
    {
        "r_name": "Donic Bluestorm Z1 Turbo",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-bluestorm-z1-turbo",
        "r_spin": "97",
        "r_speed": "98",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-bluestorm-z1-turbo.jpg?8",
        "r_description_1": "â¢ Donic Bluestorm Z1 Turbo rubber is Power personified.  \nâ¢ It has a middle-pored sponge with a short wide pimpled structure.\nâ¢ The Turbo has a 50Â° sponge and is therefore slightly harder than the standard Z1. \nâ¢ Donic has produced a more dynamic version of Z1 with Bluestorm Z1 Turbo. \nâ¢ The sponge of Z1 Turbo is slightly harder but with the same middle pore size. \nâ¢ An almost perfect combination with the very thin high-tension pimpled rubber and \nthe highly valued dynamic blue sponge. The perfect weapon for uncompromising attackers!",
        "r_description_2": "A STORM BREWS! BLUE ALERT!"
    },
    {
        "r_name": "Donic Bluestorm Z2",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-bluestorm-z2",
        "r_spin": "97",
        "r_speed": "95",
        "r_control": "70",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-bluestorm-z2.jpg?8",
        "r_description_1": "Donic Bluestorm Z2: A POWERFUL STORM!",
        "r_description_2": "Bluestorm Z2 has a long, thin pimple structure and a large pored sponge. \nThis 47.5 degree medium hard sponge is ideal for many players."
    },
    {
        "r_name": "Donic Bluestorm Z3",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-bluestorm-z3",
        "r_spin": "97",
        "r_speed": "91",
        "r_control": "73",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-bluestorm-z3.jpg?8",
        "r_description_1": "Donic Bluestorm Z3: A THUNDERBOLT!",
        "r_description_2": "Bluestorm Z3 with its large pored 42.5 degree sponge is considerably softer. \nThis makes a difference. One not only feels it but also hears it. Lovers of freshly glued rubbers will delight in the sound."
    },
    {
        "r_name": "Donic Coppa JO Silver",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-coppa-jo-s",
        "r_spin": "93",
        "r_speed": "91",
        "r_control": "74",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "This is a rubber sheet that most players will feel very comfortable with, especially European players.",
        "r_description_2": "Coppa J. O. Silver is considerably softer, but due to its high built in speed glue effect, it plays like a medium hard, speed glue rubber."
    },
    {
        "r_name": "Donic Coppa X3 Silver",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-coppa-x3-silver",
        "r_spin": "93",
        "r_speed": "92",
        "r_control": "71",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-coppa-x3-silver.jpg?8",
        "r_description_1": "DONIC Coppa X3 (Silver) evokes the best memories from speed glue times! Coppa X3's mega-loud sound and easily controlled speed is a great pleasure to use. With soft sponge, it offers perfect control and is suitable for an active topspin game from all positions. It is outstanding for players with an allround style who require good control plus speed.\nSponge hardness: soft",
        "r_description_2": "Playing characteristics: Very soft with superb control and a unique sound.\nRecommended for: Allround players who require good control plus speed."
    },
    {
        "r_name": "Donic Desto F1 HS",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-desto-f1-hs",
        "r_spin": "91",
        "r_speed": "95",
        "r_control": "68",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-desto-f1-hs.jpg?8",
        "r_description_1": "DESTO F1-HS: Feels not harder, but is significantly faster.",
        "r_description_2": "Almost all top professionals prefer to play with harder rubber. They then use many layers of speed glue to bring the rubber up to full speed and maximum performance."
    },
    {
        "r_name": "Donic Desto F3 Big Slam",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-destof3-bsl",
        "r_spin": "94",
        "r_speed": "85",
        "r_control": "72",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "DONIC DESTO F3 BigSlam",
        "r_description_2": "The sound of speed gluing has been captured in F3 BigSlam rubbers:"
    },
    {
        "r_name": "Donic Desto F4",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-desto-f4",
        "r_spin": "103",
        "r_speed": "80",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-desto-f4.jpg?8",
        "r_description_1": "Donic Formula F4 is the perfect introduction for ambitious youngsters and players who want to change to rubbers with inbuilt speed glue effect. For those who seek clever placement and variation in their play and not just brute force, Donic is the right choice. Our rubber provides an introduction to the fascination of Formula Donic (inbuilt speed glue effect) ? for the improving ambitious player. The soft sponge, with slightly reduced speed glue effect, combines the control of classic rubbers with the dynamic of the modern generation of rubbers.\nFor all those who take advantage of their chances, and that at an astonishingly fair price. Made in Germany.",
        "r_description_2": "Speed: 80 \nSpin: 103\nControl: 80"
    },
    {
        "r_name": "Donic Quattro Formula",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-quattro-formula",
        "r_spin": "93",
        "r_speed": "83",
        "r_control": "74",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "Incorporates Speed Gluing Effect, But Is Not Too Fast \nExperts have known it for a long time: while speed gluing makes rubber faster, the dominant effect is to make the rubber softer and - at least subjectively - to produce better ball control - despite the speed-glued rubber being spinnier and faster.",
        "r_description_2": "By adding Formula tuning to our QUATTRO rubber, we have increased the performance, but we have limited the speed to ensure that you can easily keep the rubber under control. As a result, new QUATTRO Formula rubber incorporates all the traditional advantages of speed glue, while giving more ball control and higher precision. This makes QUATTRO Formula ideal for allround players and players who prefer good ball control."
    },
    {
        "r_name": "Donic Spike P1",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-spike-p1",
        "r_spin": "n/a",
        "r_speed": "35",
        "r_control": "35",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-spike-p1.jpg?8",
        "r_description_1": "Donic Spike P1 is a classic defensive pimpled rubber designed for the ambitious, technically advanced defender. The ribbed pimpled top surface makes possible a vast array of variations of play and extreme backspin. Even when a thinner sponge is used, the defender has the ability to vary the degree of spin up to maximum rotation. This rubber has been developed in close association with WANG XI, one of the best German Bundesliga players for many years.",
        "r_description_2": "â¢ Medium hard sponge \nâ¢ elastic pimple rubber mixture \nâ¢ extreme backspin\nâ¢ especially designed for the classic defender\nâ¢ good for attacking play"
    },
    {
        "r_name": "Donic Spike P2",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-spike-p2",
        "r_spin": "n/a",
        "r_speed": "33",
        "r_control": "37",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-spike-p2.jpg?8",
        "r_description_1": "This long pimpled rubber owes its unique playing qualities to a combination of an extremely soft sponge and the specially developed long pimpled top surface.",
        "r_description_2": "Spike P2 with soft sponge increases control when back spinning close to the table and facilitates surprise attack and variation, which can disturb the opponent. The specially designed structure of the pimples makes it possible for the modern defender to employ all the strokes necessary for top play. \nThis new rubber was developed together with MASATO SHIONO from Japan, one of the best defenders in the world."
    },
    {
        "r_name": "Donic Vario Big Slam",
        "link": "https://www.megaspin.net/store/default.asp?pid=d-vario-bs",
        "r_spin": "n/a",
        "r_speed": "80",
        "r_control": "78",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_d-vario-bs.jpg?8",
        "r_description_1": "For more than two very successful decades the DONIC Vario rubber series has had a lasting impact on the sport of table tennis. Now, for the first time DONIC presents a rubber sheet in this series labelled \"Made in Germany\". The DONIC Vario Big Slam is the result of the world famous Formula DONIC technology with inbuilt speed glue effect.\nDue to its extremely soft 35 degree sponge, you get perfect feeling on the blade. This is the ideal rubber for spin and rotation players who prefer soft rubbers and like to hear a fantastic sound when hitting the ball.",
        "r_description_2": "Speed: 80\nSpin: 105\nControl: 78\nDurability: Soft\nSurface: Spin-Elastic"
    },
    {
        "r_name": "Gamber Big Gun Thor's Hammer",
        "link": "https://www.megaspin.net/store/default.asp?pid=g-big-gun-thor-h",
        "r_spin": "95",
        "r_speed": "96",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_g-big-gun-thor-h.jpg?8",
        "r_description_1": "Gambler Big Gun is an aggressive attack rubber for players who wish to initiate power with pace from midcourt. \nThor's Hammer is special hard professional grade large cell sponge, much faster than a traditional sponge, that works fantastic tuned.",
        "r_description_2": "We generally recommend this type of sponge for advanced or professional players."
    },
    {
        "r_name": "Gambler Aces Pro Competitor",
        "link": "https://www.megaspin.net/store/default.asp?pid=gambler-aces-pro",
        "r_spin": "95",
        "r_speed": "92",
        "r_control": "88",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_gambler-aces-pro.jpg?8",
        "r_description_1": "Aces Pro competitor series designed for the post 2016 era where the plastic 40+ ball is the standard.",
        "r_description_2": "â¢ Perfect harmony of light tack and mechanical spin.\nâ¢ Quick settle in period, optimal playing attributes after a very short period.\nâ¢ Extremely light (51g+-3 for a 2.1mm sheet of rubber)\nâ¢ Deep Power for a featherweight rubber.\nâ¢ Stacked ICMS large pore sponge fantastic with or without oil based tuners."
    },
    {
        "r_name": "Gambler Big Gun",
        "link": "https://www.megaspin.net/store/default.asp?pid=gambler-big-gun",
        "r_spin": "95",
        "r_speed": "96",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_gambler-big-gun.jpg?8",
        "r_description_1": "Gambler Big Gun is an aggressive attack rubber for players who wish to initiate power with pace from mid court.",
        "r_description_2": "Speed:96\nSpin: 95\nControl: 80"
    },
    {
        "r_name": "Gambler Burst",
        "link": "https://www.megaspin.net/store/default.asp?pid=gambler-burst",
        "r_spin": "99",
        "r_speed": "90",
        "r_control": "91",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_gambler-burst.jpg?8",
        "r_description_1": "Gambler Burst is an aggressively tacky attack rubber for players who wish to use heavy spin. Suitable for close attack and 3rd ball push to attack and heavy over the table loop.",
        "r_description_2": "Speed: 90\nSpin: 99\nControl: 91"
    },
    {
        "r_name": "Gambler GXL",
        "link": "https://www.megaspin.net/store/default.asp?pid=gambler-gxl",
        "r_spin": "55",
        "r_speed": "55",
        "r_control": "94",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_gambler-gxl.jpg?8",
        "r_description_1": "Gambler GXL is an aggressive LONG PIPS out designed rubber to give spin reversal and moderate disruptive effects. Suitable for high level chopping as well as selective hitting, easy serve return, and attacking vs backspin/push.",
        "r_description_2": "Try it, you will like it!"
    },
    {
        "r_name": "Gambler GXL OX",
        "link": "https://www.megaspin.net/store/default.asp?pid=gambler-gxl-ox",
        "r_spin": "55",
        "r_speed": "55",
        "r_control": "94",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_gambler-gxl-ox.jpg?8",
        "r_description_1": "",
        "r_description_2": "OX version - no sponge."
    },
    {
        "r_name": "Gambler GXS",
        "link": "https://www.megaspin.net/store/default.asp?pid=gambler-gxs",
        "r_spin": "84",
        "r_speed": "98",
        "r_control": "84",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_gambler-gxs.jpg?8",
        "r_description_1": "Gambler GXS is a fast attacking short pips out rubber with powerful grip topped pimples.",
        "r_description_2": "GXS is designed with the off the bounce all out attacker in mind. GXS is very powerful and plays with exceptional spin for an all out pip rubber."
    },
    {
        "r_name": "Gambler Mech-Tek Predator",
        "link": "https://www.megaspin.net/store/default.asp?pid=g-mech-tek-predator",
        "r_spin": "97",
        "r_speed": "94",
        "r_control": "88",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_g-mech-tek-predator.jpg?8",
        "r_description_1": "Mech-Tek Predator is an aggressive mechanical rubber perfect for players who prefer a bouncy rubber with a high grip feeling. Mech-Tek uses a taller pip geometry giving enhanced ability to hold the ball longer.  Mech-Tek is comparable to Japanese or European rubbers in terms of grip and spin generation.",
        "r_description_2": "Sponge Type: GearZ High Volume (black comes with national blue color, red comes with glow yellow)\nNote: While the sponge and power is very similar to \"Tenergy\" the top sheet has significantly more grip when coupled with the composite ball."
    },
    {
        "r_name": "Gambler Sevens Pro",
        "link": "https://www.megaspin.net/store/default.asp?pid=gambler-sevens-pro",
        "r_spin": "93",
        "r_speed": "90",
        "r_control": "90",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_gambler-sevens-pro.jpg?8",
        "r_description_1": "Sevens Pro competitor series designed for the post 2016 era where the plastic 40+ ball is the standard.",
        "r_description_2": "â¢ Perfect harmony of light tack and mechanical spin.\nâ¢ Quick settle in period, optimal playing attributes after a very short period.\nâ¢ Extremely light (51g+-3 for a 2.1mm sheet of rubber)\nâ¢ Deep Power for a featherweight rubber.\nâ¢ Stacked ICMS large pore sponge fantastic with or without oil based tuners."
    },
    {
        "r_name": "Gambler Shadow",
        "link": "https://www.megaspin.net/store/default.asp?pid=g-shadow",
        "r_spin": "99",
        "r_speed": "90",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_g-shadow.jpg?8",
        "r_description_1": "Designed for the post tuner and speed glue era, this rubber has maximum friction and power right out of the package. Hybrid conic pip structure gives the top sheet more synergy with the sponge for a quicker response. Shadow is designed for spin and control. Ideal for players who want to win points with a balance of spin, speed and placement.",
        "r_description_2": "This s a soft rubber with fairly aggressive tack. Increased dwell time great to increase consistency of the loop without sacrificing heavy spin."
    },
    {
        "r_name": "Gambler X3 Diamond Gearz",
        "link": "https://www.megaspin.net/store/default.asp?pid=g-x3-diamond-g",
        "r_spin": "90",
        "r_speed": "98",
        "r_control": "88",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_g-x3-diamond-g.jpg?8",
        "r_description_1": "Gambler X3 Diamond Gearz Sponge is an aggressive mechanical spin rubber.\nX3D creates spin in the same fashion as high power European rubbers, using mechanical force to grip and spin. \nIt is ideal for European style away from the table play or alternatively high speed back hand coupled with tacky forehand.\nGearz Sponge is a large cell with mid hardness and higher rebound made for ALL+ and aggressive style of play. It is 100% Mechanical.",
        "r_description_2": "Speed: 98 \nSpin: 90 \nControl: 88"
    },
    {
        "r_name": "Gambler X3 Diamond Thor's Hammer",
        "link": "https://www.megaspin.net/store/default.asp?pid=gambler-x3-dth",
        "r_spin": "90",
        "r_speed": "98",
        "r_control": "88",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_gambler-x3-dth.jpg?8",
        "r_description_1": "Gambler X3 Diamond with Thor's Hammer Sponge is an aggressive mechanical spin rubber. X3D creates spin in the same fashion as high power European rubbers, using mechanical force to grip and spin. Ideal for European style away from the table play or alternatively high speed back hand coupled with tacky forehand.\nThor?s Hammer Sponge is a large cell, very hard, for aggressive attack only. 100% Mechanical.\n \nSpeed: 98\nSpin: 90\nControl: 88",
        "r_description_2": "Rubber FAQ and Guide - what you need to know when buying rubber sheets."
    },
    {
        "r_name": "Gambler Zero",
        "link": "https://www.megaspin.net/store/default.asp?pid=gambler-zero",
        "r_spin": "88",
        "r_speed": "94",
        "r_control": "97",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_gambler-zero.jpg?8",
        "r_description_1": "Gambler Zero is a mechanical spin type rubber, generating spin exclusively via grip. Zero's non-tacky surface is ideal for away table play or flat hitting (just like Japan or Euro rubber).",
        "r_description_2": "Speed: 94\nSpin: 88\nControl: 97"
    },
    {
        "r_name": "Gambler Zero Blue Diamond Sponge",
        "link": "https://www.megaspin.net/store/default.asp?pid=gambler-zero-diamond",
        "r_spin": "88",
        "r_speed": "94",
        "r_control": "97",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_gambler-zero-diamond.jpg?8",
        "r_description_1": "Gambler Zero is a mechanical spin type rubber, generating spin exclusively via grip. Zero's non-tacky surface is ideal for away table play or flat hitting (just like Japan or Euro rubber).",
        "r_description_2": "Blue Diamond is a mid-hard sponge rather than a soft.\n \nSpeed: 94\nSpin: 88\nControl: 97"
    },
    {
        "r_name": "JOOLA 4 All",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-4all",
        "r_spin": "65",
        "r_speed": "65",
        "r_control": "95",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA 4 You",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-4you",
        "r_spin": "78",
        "r_speed": "78",
        "r_control": "95",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Axxess",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-axxess",
        "r_spin": "n/a",
        "r_speed": "n/a",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Badman Reloaded",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-badman-reloaded",
        "r_spin": "55",
        "r_speed": "63",
        "r_control": "100",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA CWX",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-cwx",
        "r_spin": "n/a",
        "r_speed": "n/a",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Energy",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-energy",
        "r_spin": "85",
        "r_speed": "90",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Energy 325",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-energy-325",
        "r_spin": "83",
        "r_speed": "80",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Energy X-Tra",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-energy-x-tra",
        "r_spin": "88",
        "r_speed": "83",
        "r_control": "87",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Express Ultra",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-express-ultra",
        "r_spin": "68",
        "r_speed": "97",
        "r_control": "90",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Golden Tango",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-golden-tango",
        "r_spin": "128",
        "r_speed": "118",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Golden Tango PS",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-golden-tango-ps",
        "r_spin": "n/a",
        "r_speed": "n/a",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Mambo",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-mambo",
        "r_spin": "70",
        "r_speed": "70",
        "r_control": "82",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Mambo H",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-mambo-h",
        "r_spin": "83",
        "r_speed": "80",
        "r_control": "75",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Maxxx 400",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-maxxx-400",
        "r_spin": "110",
        "r_speed": "108",
        "r_control": "90",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Maxxx 450",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-maxxx-450",
        "r_spin": "113",
        "r_speed": "111",
        "r_control": "82",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Maxxx 500",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-maxxx-500",
        "r_spin": "116",
        "r_speed": "117",
        "r_control": "70",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Maxxx-P",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-maxxx-p",
        "r_spin": "120",
        "r_speed": "117",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Novic",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-novic",
        "r_spin": "96",
        "r_speed": "80",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Octopus",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-octopus",
        "r_spin": "60",
        "r_speed": "53",
        "r_control": "90",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Rhyzer 43",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-rhyzer-43",
        "r_spin": "123",
        "r_speed": "120",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Rhyzer 48",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-rhyzer-48",
        "r_spin": "124",
        "r_speed": "124",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Rhyzer Pro 50",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-rhyzer-pro-50",
        "r_spin": "n/a",
        "r_speed": "n/a",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Rhyzm",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-rhyzm",
        "r_spin": "106",
        "r_speed": "106",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Rhyzm 375",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-rhyzm-375",
        "r_spin": "107",
        "r_speed": "98",
        "r_control": "90",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Rhyzm 425",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-rhyzm-425",
        "r_spin": "105",
        "r_speed": "104",
        "r_control": "86",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Rhyzm Tech",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-rhyzm-tech",
        "r_spin": "120",
        "r_speed": "119",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Rhyzm-P",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-rhyzm-p",
        "r_spin": "120",
        "r_speed": "121",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Samba",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-samba",
        "r_spin": "85",
        "r_speed": "63",
        "r_control": "84",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Samba 19",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-samba-19",
        "r_spin": "121",
        "r_speed": "108",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Samba 27",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-samba-27",
        "r_spin": "124",
        "r_speed": "117",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Samba Plus",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-samba-plus",
        "r_spin": "100",
        "r_speed": "78",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Samba Tech",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-samba-tech",
        "r_spin": "111",
        "r_speed": "104",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Tango Ultra",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-tango-ultra",
        "r_spin": "75",
        "r_speed": "73",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Toni Hold Antitop",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-th-anti-topspin",
        "r_spin": "55",
        "r_speed": "48",
        "r_control": "95",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Upp",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-upp",
        "r_spin": "70",
        "r_speed": "68",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA X-Plode",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-xplode",
        "r_spin": "95",
        "r_speed": "97",
        "r_control": "85",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA X-Plode Sensitive",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-xplode-sensitive",
        "r_spin": "93",
        "r_speed": "88",
        "r_control": "90",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "JOOLA Zack",
        "link": "https://www.megaspin.net/store/default.asp?pid=j-zack",
        "r_spin": "92",
        "r_speed": "86",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Killerspin Fortissimo",
        "link": "https://www.megaspin.net/store/default.asp?pid=k-fortissimo",
        "r_spin": "94",
        "r_speed": "106",
        "r_control": "94",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "Killerspin Nitrx 4Z",
        "link": "https://www.megaspin.net/store/default.asp?pid=k-nitrx-4z",
        "r_spin": "90",
        "r_speed": "87",
        "r_control": "87",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": ""
    },
    {
        "r_name": "LKT Rapid Soft",
        "link": "https://www.megaspin.net/store/default.asp?pid=lkt-rapid-soft",
        "r_spin": "90",
        "r_speed": "80",
        "r_control": "100",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_lkt-rapid-soft.jpg?8",
        "r_description_1": "Rubber designed for the speed glue ban.",
        "r_description_2": "Soft sponge and a specialized pimple arrangement gives LKT soft a high degree of control while still maintaining the ability to generate spin at low or high speeds."
    },
    {
        "r_name": "LKT Rapid Speed",
        "link": "https://www.megaspin.net/store/default.asp?pid=lkt-rapid-speed",
        "r_spin": "100",
        "r_speed": "90",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_lkt-rapid-speed.jpg?8",
        "r_description_1": "Rubber designed for the speed glue ban.",
        "r_description_2": "Inverted rubber with a unique vertical pip array and structure, combined with high elasticity gives this rubber the ability to generate high spin and massive speed wile maintaining a low trajectory."
    },
    {
        "r_name": "LKT Stranger Attack",
        "link": "https://www.megaspin.net/store/default.asp?pid=lkt-stranger-attack",
        "r_spin": "70",
        "r_speed": "90",
        "r_control": "120",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_g-stranger-attack.jpg?8",
        "r_description_1": "Stranger Attack Long pip-out Stranger combined with a specialized pip attack sponge gives this rubber the ability to increase the ball handling time of the pips, giving the player much greater opportunity to attack.",
        "r_description_2": "Stranger Attack is designed for an aggressive style of long pip play, opening up new opportunities for players who with to add variation to their game."
    },
    {
        "r_name": "Nittaku Fastarc C-1",
        "link": "https://www.megaspin.net/store/default.asp?pid=nittaku-fastarc-c-1",
        "r_spin": "95",
        "r_speed": "96",
        "r_control": "68",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_nittaku-fastarc-c-1.jpg?8",
        "r_description_1": "The Nittaku Fastarc C-1 rubber is \"Fast\" with an \"Arc\"! It is the ingenious creation from Nittaku combining a âtension spinâ top sheet with a âsoft strong spongeâ. It takes the best attributes from earlier Fastarc rubbers: G-1 and S-1 and utilizes them to make the new Fastarc C-1. This combination creates an incredible grip and speed to allow players to create artistic shots.",
        "r_description_2": "Speed: 96\nSpin: 95\nControl: 68\nHardness: Medium"
    },
    {
        "r_name": "Nittaku Fastarc G-1",
        "link": "https://www.megaspin.net/store/default.asp?pid=nittaku-fastarc-g-1",
        "r_spin": "96",
        "r_speed": "95",
        "r_control": "68",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_nittaku-fastarc-g-1.jpg?8",
        "r_description_1": "The Nittaku Fastarc G-1 rubber is \"Fast\" with an \"Arc\"! A power topsheet with a built-in tension power sponge produces the ideal combination of ball speed and ball arc -- an outstanding powerful spin ball.",
        "r_description_2": "G-1 means \"Grip First\" and S-1 means \"Speed First\" Choose Fastarc G-1 for more spin with great power, and choose Fastarc S-1 for more speed with great spin."
    },
    {
        "r_name": "Nittaku Fastarc P-1",
        "link": "https://www.megaspin.net/store/default.asp?pid=nittaku-fastarc-p1",
        "r_spin": "95",
        "r_speed": "97",
        "r_control": "68",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_nittaku-fastarc-p1.jpg?8",
        "r_description_1": "The NITTAKU Fastarc P-1 rubber is \"Fast\" with an \"Arc\"! NITTAKU Fastarc P-1 is the new \"power-first\" version of Nittaku's Fastarc series rubber designed for the plastic poly ball. It features a Tension Power topsheet and Strong Sponge. This is the ideal new technology rubber for players who desire powerful topspin for all strokes of your game. This rubber generates explosive power along with great spin.",
        "r_description_2": "Speed: 97\nSpin: 95\nControl: 68        \nHardness: Med Hard"
    },
    {
        "r_name": "Nittaku Fastarc S-1",
        "link": "https://www.megaspin.net/store/default.asp?pid=nittaku-fastarc-s1",
        "r_spin": "94",
        "r_speed": "97",
        "r_control": "68",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_nittaku-fastarc-s1.jpg?8",
        "r_description_1": "The NITTAKU Fastarc S-1 rubber is \"Fast\" with an \"Arc\"! NITTAKU Fastarc S-1 is the speed-oriented version of Nittaku's newest rubber. Utilizing a power topsheet and tension power sponge, this rubber generates explosive power along with great spin.",
        "r_description_2": "G-1 means \"Grip First\" and S-1 means \"Speed First\" \nChoose Fastarc G-1 for more spin with great power, and choose Fastarc S-1 for more speed with great spin."
    },
    {
        "r_name": "Nittaku Hurricane 3 Neo (8701)",
        "link": "https://www.megaspin.net/store/default.asp?pid=nittaku-h3-neo-8701",
        "r_spin": "94",
        "r_speed": "91",
        "r_control": "87",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_nittaku-h3-neo-8701.jpg?8",
        "r_description_1": "Powerful NEO sponge and Hurricane 3 rubber with special stickiness create high speed arc, and improve the control over strokes. NEO Hurricane 3 creates powerful variations in your game where power of spin is the main weapon.",
        "r_description_2": "Speed: 91\nSpin: 94\nControl: 87        \nHardness: Medium"
    },
    {
        "r_name": "Nittaku Hurricane Pro 3 Turbo Orange",
        "link": "https://www.megaspin.net/store/default.asp?pid=n-h3-pro-t",
        "r_spin": "98",
        "r_speed": "93",
        "r_control": "70",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_n-h3-pro-t.jpg?8",
        "r_description_1": "Collaboration of Japanese and Chinese technology has produced the outstanding Nittaku Hurricane Pro III Turbo Orange rubber! The tacky/sticky topsheet made in China is combined with the high-quality high elasticity sponge made in Japan. Also includes Nittaku's active charge (AC) technology which improves speed performance.",
        "r_description_2": "Mima Ito, 2017 World Championships Bronze Medalist, stated, \"With Hurricane Pro III Turbo Orange, it is easy to spin, and the quality of serve receive and drive is high. Moreover, it does not feel harder than the actual sponge hardness, making it easy to do smashing and blocking, and various kinds of ball types can be drawn out. It is my favorite rubber because I can make use of the characteristics of my playing style, but I also think that any player can achieve success with this rubber, and so I recommend it.\" \n      \nSpeed:93\nSpin:98\nControl:70        \nHardness: Hard"
    },
    {
        "r_name": "RITC 563 Tack Speed",
        "link": "https://www.megaspin.net/store/default.asp?pid=r-563-ts",
        "r_spin": "70",
        "r_speed": "70",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "RITC-563  Medium Long Pips out rubber.\nThe all new design, very good attacking properties with some of the knuckle ball effects of a long pips out rubber. Improved quality, good elasticity a excellent guard against loop drives!",
        "r_description_2": "Speed: 70\nSpin: 70\nControl: 80"
    },
    {
        "r_name": "RITC 729 729-08",
        "link": "https://www.megaspin.net/store/default.asp?pid=r-729-08",
        "r_spin": "120",
        "r_speed": "110",
        "r_control": "110",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_r-729-08.jpg?8",
        "r_description_1": "Rubber designed for the speed glue ban. Energy storing highly elastic top sheet combined with a special sponge that has a tuner effect built in. 729-08 is designed for a high degree of friction and power making this the ideal weapon for the attacking player. This is the newer version of the sponge that does not require tuners for maximum performance.",
        "r_description_2": "Speed: 110\nSpin: 120\nControl:110\nSponge:Medium"
    },
    {
        "r_name": "RITC 729 729-5",
        "link": "https://www.megaspin.net/store/default.asp?pid=r-729-05",
        "r_spin": "110",
        "r_speed": "120",
        "r_control": "120",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_r-729-05.jpg?8",
        "r_description_1": "Rubber designed for the speed glue ban. Energy storing highly elastic top sheet provides consistent power with all types of strokes. 729-5 is designed for a high degree of friction and power making this the ideal weapon for the attacking player.",
        "r_description_2": "Speed: 120\nSpin: 110\nControl:120\nSponge:Medium"
    },
    {
        "r_name": "RITC 729 Faster with Transcend Sponge",
        "link": "https://www.megaspin.net/store/default.asp?pid=r-729-f-tr",
        "r_spin": "110",
        "r_speed": "120",
        "r_control": "110",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "729 faster with Transcend Sponge\nHigh speed inverted rubber",
        "r_description_2": "â¢ superior speed and spin \nâ¢ suitable for mid distance loop \nâ¢ Made with Transcend sponge."
    },
    {
        "r_name": "RITC 729 Focus 3 Snipe",
        "link": "https://www.megaspin.net/store/default.asp?pid=r-729-focus-3-snipe",
        "r_spin": "110",
        "r_speed": "120",
        "r_control": "110",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_r-729-focus-3-snipe.jpg?8",
        "r_description_1": "High speed inverted rubber \nsuperior speed and spin \nsuitable for mid distance loop \nMade with special soft sponge.",
        "r_description_2": "ITTF/USATT/CTTA approved"
    },
    {
        "r_name": "RITC 729 Focus I",
        "link": "https://www.megaspin.net/store/default.asp?pid=r-729-focus-1",
        "r_spin": "120",
        "r_speed": "100",
        "r_control": "120",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "High speed inverted rubber\nSuperior speed and spin\nSuitable for mid distance loop\nMade with special sponge\nITTF/USATT/CTTA approved",
        "r_description_2": "Specifications:\nSpeed 100\nSpin 120\nControl 120"
    },
    {
        "r_name": "RITC 729 Higher Tension 1 Transcend Spon...",
        "link": "https://www.megaspin.net/store/default.asp?pid=r-ht-ts",
        "r_spin": "120",
        "r_speed": "100",
        "r_control": "120",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "729 \"High Tension\" inverted rubber has tension built in to the sponge and top-sheet. This help reduce the amount of energy lost at the point of impact. In essence, it turns the speed of your opponent's shot into additional power for you.",
        "r_description_2": "Great rubber for loop drive/Quick attacking.\n \nSpeed: 100\nSpin: 120\nControl: 120\nSponge: Med Soft"
    },
    {
        "r_name": "RITC 729 SP Transcend",
        "link": "https://www.megaspin.net/store/default.asp?pid=729-sp-tr",
        "r_spin": "92",
        "r_speed": "93",
        "r_control": "91",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_729-sp-tr.jpg?8",
        "r_description_1": "Great attacking power with a fast traditionally ULTRA sticky top sheet. This rubber is one of the best aggressive push to attack on the planet. Combined with Transcend sponge this product is lively away from the table as well as close. Transcend is lighter and faster than traditional Chinese sponges. Sponge stores energy to release into the ball, while most sponges allow energy to dissipate.",
        "r_description_2": "Compared with Cream Transcend, this SP variant has a bit more tack and a slightly harder sponge.  This is 729's version of the DHS Hurricane 3."
    },
    {
        "r_name": "RITC 802 Tack Speed  Pips Out",
        "link": "https://www.megaspin.net/store/default.asp?pid=r-802-ts",
        "r_spin": "70",
        "r_speed": "90",
        "r_control": "90",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "A handy weapon, block and flat hit your opponents loop. Short pips out for more direct speed. For close over the table attack players, return all spin balls with ease.",
        "r_description_2": "Speed: 90 \nSpin: 70 \nControl: 90"
    },
    {
        "r_name": "RITC 802-40",
        "link": "https://www.megaspin.net/store/default.asp?pid=r-802-40",
        "r_spin": "80",
        "r_speed": "120",
        "r_control": "110",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "Great hitting rubber \nGood spin for a pip \nProduces good spin \nSuitable for attacking players \nITTF/USATT/CTTA approved",
        "r_description_2": "The  true HAMMER of short pips. This product is suitable for close to the table hitters and power blockers. Very large conical shaped pips, tops are cross checked and rubber is hard and spinney."
    },
    {
        "r_name": "RITC 804 Anti-Spin Rubber",
        "link": "https://www.megaspin.net/store/default.asp?pid=r-804",
        "r_spin": "0",
        "r_speed": "50",
        "r_control": "90",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "RITC Friendship 804 Anti-Spin rubber, \nIncoming spin has little effect \nSinking ball \nPrecision placements \nGreat for Defensive players\nITTF/USATT/CTTA approved",
        "r_description_2": "Specifications:"
    },
    {
        "r_name": "RITC 837 Tack Speed Long Pips",
        "link": "https://www.megaspin.net/store/default.asp?pid=r-837-ts",
        "r_spin": "60",
        "r_speed": "60",
        "r_control": "70",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "Sponge: 1.0mm   Available in Black or Red.",
        "r_description_2": "Friendship 837 Long Pips-Out Table Tennis/Ping Pong Rubber with Sponge."
    },
    {
        "r_name": "RITC Friendship Super 729 FX",
        "link": "https://www.megaspin.net/store/default.asp?pid=r-f-729fx",
        "r_spin": "90",
        "r_speed": "90",
        "r_control": "90",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "FRIENDSHIP \"SUPER 729 FX\" is one of the oldest Chinese rubber sheets. Super sticky rubber surface. Capable of generating strong spin. Excellent for consistent power players requiring more control. Orange sponge and better quality!",
        "r_description_2": "Speed: 90\nSpin: 90\nControl: 90"
    },
    {
        "r_name": "Sanwei Target 90",
        "link": "https://www.megaspin.net/store/default.asp?pid=sanwei-target-90",
        "r_spin": "110",
        "r_speed": "120",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_sanwei-target-90.jpg?8",
        "r_description_1": "Our notes:  An extremely tacky topsheet. The red rubber has the same tackiness as DHS Hurricane 3. Spin is as high as Hurricane 3 but it is faster. The sponge of the Pro Red is very reactive to boosting. The Chinese sponge has a good rebound effect with a good amount of speed. The rubber can smash well despite being tacky and it is less likely to hit the net than the commercial Hurricane 3.",
        "r_description_2": "Applying the brand-new \"Accurate Attacking Technique\", the fast speed sense and stable spin controlling will bring to you more accurate beating just like the dart hit the bull's eye. The combination of classic Chinese sticky surface, thicker topsheet and lighter tension sponge, make this model more elastic, with strong attacking power and incredible spin, to be a sharp weapon for quick attack/looping player under the inorganic international rules."
    },
    {
        "r_name": "Sanwei Target National",
        "link": "https://www.megaspin.net/store/default.asp?pid=sanwei-target-national",
        "r_spin": "140",
        "r_speed": "160",
        "r_control": "120",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_sanwei-target-national.jpg?8",
        "r_description_1": "",
        "r_description_2": "Our notes:\nâ¢ Uncut weight is approx. 63 grams\nâ¢ Very tacky topsheet similar to both Hurricane 3 and Haifu Whale 2 rubbers. Topsheet is softer than Hurricane 3 on top of a hard and lively sponge.\nâ¢ Faster than the commercial DHS Hurricane 3 with the same level of spin.\nâ¢ For most Chinese rubbers, the black one is the tackier one and the red is the harder one. In the case of the National Target rubber, the red one is tackier and slower. The red version can be a good chopping rubber and is a very spinny rubber. The black version can be a modern attacking forehand rubber because it is less tackier and faster. It feels like a euro-chinese rubber hybrid rubber. Both are factory-tuned but the tackiness of the red version makes it slower and grips the ball more so it is ideal for chopping. The red version has high arc while the black version has medium arc. Uncut weight is 63 grams."
    },
    {
        "r_name": "Sanwei Target Pro Blue",
        "link": "https://www.megaspin.net/store/default.asp?pid=sanwei-target-pro-blue",
        "r_spin": "115",
        "r_speed": "120",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_sanwei-target-pro-blue.jpg?8",
        "r_description_1": "Our notes:  This feels similar Tibhar K1 Hybrid but at a cheaper price. The sponge is an improvement over the original Target National and also softer at 39 degrees. The original Target National has a much harder sponge. The Pro Blue National has the same topsheet over a new sponge which makes it easier to use. Also, the Pro Blue has a much lower throw and is ideal for loop drives and fast loops over the table. Stiff or medium stiff blades are recommended for the Pro Blue.  Works great when boosted.",
        "r_description_2": "Specially made high density sponge. With accurate control of vulcanization, the expansion process avoids shrinkage and tearing of sponge, Increases the service life of rubber.\nThanks to the high mesh number module production technique, the rubber could bring stronger spin and more stable power output, continuous counter-attack, and easy control of close table stroke. It's a great option for modern skill professional player"
    },
    {
        "r_name": "Sanwei Ultraspin T88",
        "link": "https://www.megaspin.net/store/default.asp?pid=sanwei-ultraspin-t88",
        "r_spin": "115",
        "r_speed": "115",
        "r_control": "n/a",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_sanwei-ultraspin-t88.jpg?8",
        "r_description_1": "The new semi-sticky Ultraspin is a good choice for training which integrates speed, rotation, elasticity, control and weight.   These five aspects as a whole, in order to improve the learning performance of children and beginners, this rubber is highly recommended by table tennis coaches because of its good value for money.",
        "r_description_2": "Hardness: 39 degrees\nSpeed: 115\nSpin:115"
    },
    {
        "r_name": "Stiga Airoc Astro M",
        "link": "https://www.megaspin.net/store/default.asp?pid=s-airoc-astro-m",
        "r_spin": "97",
        "r_speed": "99",
        "r_control": "65",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_s-airoc-astro-m.jpg?8",
        "r_description_1": "In Airoc Astro, STIGA has multiplied the amount of microscopic air bubbles (Oxygen Capsule System) in the sponge, creating more intense catapult effect and speed. The new topsheet transfers energy between sponge and ball, providing every stroke with precision and power. Developed with members of the Chinese National Team to take advantage of the new Poly Ball.",
        "r_description_2": "Airoc Astro M is the medium sponge version."
    },
    {
        "r_name": "Stiga Airoc Astro S",
        "link": "https://www.megaspin.net/store/default.asp?pid=s-airoc-astro-s",
        "r_spin": "98",
        "r_speed": "96",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_s-airoc-astro-s.jpg?8",
        "r_description_1": "In Airoc Astro, STIGA has multiplied the amount of microscopic air bubbles (Oxygen Capsule System) in the sponge, creating more intense catapult effect and speed. The new topsheet transfers energy between sponge and ball, providing every stroke with precision and power. Developed with members of the Chinese National Team to take advantage of the new Poly Ball.",
        "r_description_2": "Airoc Astro S is the soft sponge version."
    },
    {
        "r_name": "Stiga Airoc M",
        "link": "https://www.megaspin.net/store/default.asp?pid=s-airoc-m",
        "r_spin": "97",
        "r_speed": "98",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_s-airoc-m.jpg?8",
        "r_description_1": "",
        "r_description_2": "STIGA Airoc utilizes STIGA's new OCS sponge technology (Oxygen Capsule System) to increase catapult effect without changing the spin ratio. This allows aggressive players to maintain the same spin/speed proportions they have always enjoyed. The key to this evolutionary advancement is the delicate balance between the size of the air pockets within the sponge and the elasticity of the top sheet. STIGA's engineers tested many different pips designs and tensions to achieve the perfect rubber for the attacking player. Poly Ball Optimized!"
    },
    {
        "r_name": "Stiga Airoc S",
        "link": "https://www.megaspin.net/store/default.asp?pid=s-airoc-s",
        "r_spin": "98",
        "r_speed": "94",
        "r_control": "68",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_s-airoc-s.jpg?8",
        "r_description_1": "",
        "r_description_2": "STIGA Airoc utilizes STIGA's new OCS sponge technology (Oxygen Capsule System) to increase catapult effect without changing the spin ratio. This allows aggressive players to maintain the same spin/speed proportions they have always enjoyed. The key to this evolutionary advancement is the delicate balance between the size of the air pockets within the sponge and the elasticity of the top sheet. STIGA's engineers tested many different pips designs and tensions to achieve the perfect rubber for the attacking player. Poly Ball Optimized!"
    },
    {
        "r_name": "Stiga Boost TX",
        "link": "https://www.megaspin.net/store/default.asp?pid=stiga-boost-tx",
        "r_spin": "91",
        "r_speed": "94",
        "r_control": "71",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_stiga-boost-tx.jpg?8",
        "r_description_1": "Boost TX is one of the fastest rubber sheets Stiga has ever produced. It is very bouncy and gives a tremendous catapult effect with Stiga's sponge formula TTS Trans Tension Sponge.",
        "r_description_2": "Boost TX (Tension eXcelleration) is the answer for the player who wants to achieve optimum acceleration without speed glue, because of its outstanding combination of speed and spin. Trans Tension Sponge TTS generates maximum tension, and it provides high acceleration returns for a fast spin and speed game. The sponge has medium hardness, in between the hardness of Boost TC and Boost TP. Boost TX is recommended for highly trained attackers with good technical know-how."
    },
    {
        "r_name": "Stiga Calibra LT",
        "link": "https://www.megaspin.net/store/default.asp?pid=stiga-calibra-lt",
        "r_spin": "91",
        "r_speed": "96",
        "r_control": "70",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_stiga-calibra-lt.jpg?8",
        "r_description_1": "Calibra LT from STIGA has a medium hard sponge, suitable for the highly skilled player with excellent technique. Calibra LT is for advanced players who demand tremendous spin and speed, combined with a sensitive touch. If you want to advance your game, this is the rubber for you!",
        "r_description_2": "With the Calibra series we have created a totally new dimension to the game. We focused on creating a longer trajectory on the ball, as a long trajectory in today's game is more and more important. The combination of spin, speed and long trajectory is unique to this rubber series; you have never felt this level of play before. With the Calibra LT rubbers you will be able to perform strokes and shots never before possible. You will still have control for all the small shots and service return, but when you are attacking you will be in a totally new world. The Calibra LT series will take your game to another level."
    },
    {
        "r_name": "Stiga Calibra LT Plus",
        "link": "https://www.megaspin.net/store/default.asp?pid=s-calibra-lt-plus",
        "r_spin": "91",
        "r_speed": "97",
        "r_control": "69",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "Calibra LT Plus has an extra hard sponge that ensures tremendous power when hitting. This is an excellent choice for the highly skilled player who demands a professional combination of spin, speed, power and long trajectory.",
        "r_description_2": "Speed: 97   \nSpin: 91   \nControl: 69   \nHardness: Hard"
    },
    {
        "r_name": "Stiga Calibra LT Sound",
        "link": "https://www.megaspin.net/store/default.asp?pid=stiga-calibra-lt-s",
        "r_spin": "93",
        "r_speed": "94",
        "r_control": "71",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_stiga-calibra-lt-s.jpg?8",
        "r_description_1": "Calibra LT Sound from STIGA has a soft sponge, making this rubber suitable for all types of players that like the attacking game. With the softer sponge you get more control, especially for blocks and receiving serves, but you are still able to make lethal strokes to finish your opponent. The soft sponge on the Calibra LT Sound will also give you a crisp clear sound when striking the ball. This is the closest you will get to the feeling and sound of speed glue!",
        "r_description_2": "With the Calibra series STIGA has created a totally new dimension to the game. We focused on creating a longer trajectory on the ball, as a long trajectory in today's game is more and more important. The combination of spin, speed and long trajectory is unique to this rubber series; you have never felt this level of play before. With the Calibra LT rubbers you will be able to perform strokes and shots never before possible. You will still have control for all the small shots and service return, but when you are attacking you will be in a totally new world. The Calibra LT series will take your game to another level."
    },
    {
        "r_name": "Stiga Calibra LT Spin",
        "link": "https://www.megaspin.net/store/default.asp?pid=s-calibra-lt-spin",
        "r_spin": "92",
        "r_speed": "95",
        "r_control": "70",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "Calibra LT Spin has a medium soft sponge recommended for highly trained attackers and loopers who emphasize tactical spin. You will have outstanding control for touch shots and service return, but when you are attacking you will experience new levels of possibility.",
        "r_description_2": "Speed: 95 \nSpin: 92\nControl: 70\nHardness: Medium"
    },
    {
        "r_name": "Stiga Calibra Tour S",
        "link": "https://www.megaspin.net/store/default.asp?pid=s-calibra-tour-s",
        "r_spin": "97",
        "r_speed": "95",
        "r_control": "68",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_s-calibra-tour-s.jpg?8",
        "r_description_1": "Calibra Tour S has a soft sponge. Equipped with the brand new APS-technology, it provides very high speed and the fantastic possibility to shape your shots with the increased spin features. The APS technology (Advanced Pimple Structure) with straight shaped pimples (smooth surface) makes the rubber adapt to the ball like never before and provides an explosive and spinny rubber that is reliable in every situation.\nCalibra Tour S is suitable for players with lower hitting power who need a rubber that helps generate extra speed with the exceptionally lovely sound of built-in speed glue effect. Enjoy the ultimate precision-shot-making experience!",
        "r_description_2": "Sponge Hardness: Soft        \nSpeed: 95        \nSpin: 97        \nControl:68"
    },
    {
        "r_name": "Stiga Magna TS II",
        "link": "https://www.megaspin.net/store/default.asp?pid=s-magna-ts-ii",
        "r_spin": "88",
        "r_speed": "86",
        "r_control": "74",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_s-magna-ts-ii.jpg?8",
        "r_description_1": "Magna TS II is the outstanding choice for offensive players of almost all playing levels who like soft sponges with an amazing sound when striking the ball. Magna TS II gives you excellent control of all your strokes, thanks to the unique Magna surface, while the specially developed TS II sponge gives you the speed you are searching for when attacking the ball.",
        "r_description_2": "The success of the Tension Clic and Tension Sound sponges is enormous with our Boost rubbers. We have developed a new version of these sponges and combined them with our very popular Magna top sheet. The new version of the Tension Clic and Tension Sound sponges is developed specifically to fit the unique characteristics of the Magna top sheet and will transform your game, bringing out the very best in each individual player."
    },
    {
        "r_name": "Stiga Mantra H",
        "link": "https://www.megaspin.net/store/default.asp?pid=s-mantra-h",
        "r_spin": "97",
        "r_speed": "97",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_s-mantra-h.jpg?8",
        "r_description_1": "New Mantra H rubber from Stiga!\nThe new Stiga Mantra is developed with the latest Japanese rubber technology and offers the perfect balance of synthetic and natural rubber. This new rubber mixture creates a tension between the surface and the sponge resulting in an incredible catapult effect. Microscopic air bubbles in the sponge (Oxygen Capsule System) provide great speed with a stable and consistent hit and touch. This rubber is perfect for players who require the highest in rubber quality and performance. Mantra is suitable for all types of players, with sponge variation ranging from soft to hard: Mantra S, Mantra M, and Mantra H.",
        "r_description_2": "Mantra H (hard sponge version)\nâ¢ The hard sponge creates the classic feel with extreme attacking possibilities\nâ¢ Very high speed and effectiveness from short distance\nâ¢ Excellent blocking abilities in close to table action\nâ¢ Heavy rotation topspin in flicks and offensive returns."
    },
    {
        "r_name": "Stiga Mantra M",
        "link": "https://www.megaspin.net/store/default.asp?pid=s-mantra-m",
        "r_spin": "97",
        "r_speed": "96",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_s-mantra-m.jpg?8",
        "r_description_1": "New Mantra M rubber from STIGA! \nThe new STIGA Mantra is developed with the latest Japanese rubber technology and offers the perfect balance of synthetic and natural rubber. This new rubber mixture creates a tension between the surface and the sponge resulting in an incredible catapult effect. Microscopic air bubbles in the sponge (Oxygen Capsule System) provide great speed with a stable and consistent hit and touch. This rubber is perfect for players who require the highest in rubber quality and performance. Mantra is suitable for all types of players, with sponge variation ranging from soft to hard: Mantra S, Mantra M, and Mantra H.",
        "r_description_2": "Mantra M (medium sponge version)\nâ¢ The medium sponge creates a high-speed rubber with great hitting power\nâ¢ High speed and feeling from a mid distance\nâ¢ Gives players the upper hand in spin-spin rallies\nâ¢ Produces extreme spin in serves when desired."
    },
    {
        "r_name": "Stiga Mantra S",
        "link": "https://www.megaspin.net/store/default.asp?pid=s-mantra-s",
        "r_spin": "97",
        "r_speed": "92",
        "r_control": "70",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_s-mantra-s.jpg?8",
        "r_description_1": "New Mantra S rubber from STIGA! \nThe new STIGA Mantra is developed with the latest Japanese rubber technology and offers the perfect balance of synthetic and natural rubber. This new rubber mixture creates a tension between the surface and the sponge resulting in an incredible catapult effect. Microscopic air bubbles in the sponge (Oxygen Capsule System) provide great speed with a stable and consistent hit and touch. This rubber is perfect for players who require the highest in rubber quality and performance. Mantra is suitable for all types of players, with sponge variation ranging from soft to hard: Mantra S, Mantra M, and Mantra H.",
        "r_description_2": "Mantra S (soft sponge version)\nâ¢ The soft sponge creates a high spin rubber with excellent feel\nâ¢ Perfect soft sponge sound\nâ¢ Tremendous feeling from long distance\nâ¢ Exceptional control in serve and returns."
    },
    {
        "r_name": "Tibhar Evolution EL-P",
        "link": "https://www.megaspin.net/store/default.asp?pid=t-evolution-el-p",
        "r_spin": "97",
        "r_speed": "96",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_t-evolution-el-p.jpg?8",
        "r_description_1": "Evolution EL-P from TIBHAR is the most elastic rubber of the Evolution rubber series. EL-P with its medium sponge perfectly fits in between the harder MX-P and the softer FX-P. The selected pimple geometry of the elastic EL-P does not even come close to the other Evolution versions in terms of Spin and speed. Very precise and powerful strokes can be realised at half distance or at the table. Evolution EL-P: chosen by most of the Topspin players for whom the MX version is too hard and the FX version too soft, however putting the emphasis on rotation and power!",
        "r_description_2": "PRO-TENSION rubber surface is grippy and rich in spin, with perfect elasticity and stability."
    },
    {
        "r_name": "Tibhar Evolution EL-S",
        "link": "https://www.megaspin.net/store/default.asp?pid=t-evolution-el-s",
        "r_spin": "122",
        "r_speed": "123",
        "r_control": "85",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_t-evolution-el-s.jpg?8",
        "r_description_1": "When Evolution EL-S the tremendous spin values of the MX-S and the power of the MX-P were combined with a completely new surface. In combination with a medium hard sponge and a specially tuned pimple geometry, another independent lining in the Evolution series has been created which sets new standards in terms of elasticity. The outstanding Racket Ball coupling ensures a soulful touch despite enormous dynamics and highest spin values. Outstanding topspin on backspin, sets of EL-S in the reconstruction of another on top of it and provides maximum rotation and power in all game situations.\n\t\nSpeed:123\nSpin:122\nControl:85",
        "r_description_2": "Rubber FAQ and Guide - what you need to know when buying rubber sheets."
    },
    {
        "r_name": "Tibhar Evolution FX-P",
        "link": "https://www.megaspin.net/store/default.asp?pid=t-evolution-fx-p",
        "r_spin": "98",
        "r_speed": "94",
        "r_control": "68",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_t-evolution-fx-p.jpg?8",
        "r_description_1": "Evolution FX-P from TIBHAR is the most flexible and soft version of the EVOLUTION rubber family. This rubber confers a lot of sensation and control in any playing situation. FX-P is a high-performing rubber proven by the enormous sound resulting from topspin strokes. The rubber surface is rich in spins and its soft sponge with high catapult effect gives the sufficient power necessary for a variable topspin game. The player who likes to attack near the table and is not willing to concede any ball while playing a risky game will be delighted by the fine tuning of the rubber surface with the soft sponge of the EVOLUTION FX-P.",
        "r_description_2": "PRO-TENSION rubber surface is grippy and rich in spin, with perfect elasticity and stability."
    },
    {
        "r_name": "Tibhar Evolution FX-S",
        "link": "https://www.megaspin.net/store/default.asp?pid=t-evolution-fx-s",
        "r_spin": "118",
        "r_speed": "100",
        "r_control": "74",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_t-evolution-fx-s.jpg?8",
        "r_description_1": "The FX-S is the \"little brother\" of the EL-S. Again, the enormous spin values ??of the MX-S and the power of the MX-P were combined with a newly designed interface. The sponge was soft construed as the EL-S so that the FX-S still elastic plays in combination a likewise individually tailored pips geometry and its model designation \"Flexible spin\" really deserves. Much softer than MX-P and S-MX, but slightly harder than the FX-P, the FX-S still borders significantly from the medium coverings EL-P and EL-S. Thus, he is a self-lining in the Evolution series.",
        "r_description_2": "Speed:100\nSpin:118\nControl:74"
    },
    {
        "r_name": "Tibhar Evolution MX-P",
        "link": "https://www.megaspin.net/store/default.asp?pid=t-evolution-mx-p",
        "r_spin": "96",
        "r_speed": "98",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_t-evolution-mx-p.jpg?8",
        "r_description_1": "Evolution MX-P is the fastest and most dynamic rubber of the EVOLUTION rubber family. Thanks to the perfect adjustment of the pimple geometry, more flexibility is conferred to attacking balls extra energy. MX-P is very well adapted to any player's game, making no concession in terms of speed and spin. The ball/bat contact time of the MX-P is a little bit longer than the reference time, thus conferring much more sensation. Chosen by topspin players willing to feel the necessary pressure of their strokes at the table and at half distance.\nPro-Tension rubber surface is grippy and rich in spin, with perfect elasticity and stability.",
        "r_description_2": "Red Power Sponge is bright red, open porous, and spectacular. Adapts perfectly to the situation."
    },
    {
        "r_name": "Tibhar Evolution MX-P 50",
        "link": "https://www.megaspin.net/store/default.asp?pid=t-evolution-mx-p-50",
        "r_spin": "99",
        "r_speed": "102",
        "r_control": "65",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_t-evolution-mx-p-50.jpg?8",
        "r_description_1": "See also:\nJOOLA Rhyzer Pro 50",
        "r_description_2": "The rubber surface of the MX-P 50 HARD version is identical to the rubber surface of the already familiar MX-P (47.5) which is famous for its incredible grip and extraordinarily high spin. Professional players have already had this high-performance harder sponge available to them and with the new generation of plastic balls setting in, this rubber is now available to all players. Professional players have had the choice between fine-pored and large-pored sponges. The original MX-P (47.5.) is large-pored but the fine-pored variation, MX-P 50 HARD is now available. This fine-pored version plays noticeably different with an increased forward and direct trajectory and speed.Save"
    },
    {
        "r_name": "Tibhar Evolution MX-S",
        "link": "https://www.megaspin.net/store/default.asp?pid=t-evolution-mx-s",
        "r_spin": "99",
        "r_speed": "97",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_t-evolution-mx-s.jpg?8",
        "r_description_1": "This spin-oriented dynamic version possesses a much longer bat/ball contact time thanks to the especially developed pimple geometry of the rubber surface. For each player who thanks to a more physical action (acceleration arm/wrist) can activate the enormous potential of the MX-S: at the table or at half distance, this rubber will realize an even performance. EVOLUTION MX-S: chosen by most TIBHAR Bundesliga and National Players!",
        "r_description_2": "Speed: 97 \nSpin: 99 \nControl: 67 \nHardness: 46.7"
    },
    {
        "r_name": "Tibhar Hybrid K1 European Version",
        "link": "https://www.megaspin.net/store/default.asp?pid=t-hybrid-k1-euro",
        "r_spin": "97",
        "r_speed": "92",
        "r_control": "72",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_t-hybrid-k1-euro.jpg?8",
        "r_description_1": "Tibhar Hybrid K1 is a hybrid of the best of East and West! A Made-in-Germany rubber, it is developed for the standards  of Chinese table tennis art!",
        "r_description_2": "The extremely catchy, sticky surface offers great elasticity. Compared to classic Chinese rubbers there is a multiple on  acceleration and speed, making it particularly suitable for the 40+ ball."
    },
    {
        "r_name": "XIOM Omega IV Euro",
        "link": "https://www.megaspin.net/store/default.asp?pid=xiom-omega-iv-europe",
        "r_spin": "93",
        "r_speed": "88",
        "r_control": "71",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_xiom-omega-iv-europe.jpg?8",
        "r_description_1": "For technical style pros keen on balanced aggression.",
        "r_description_2": "Deeper and longer ball dragging at the surface."
    },
    {
        "r_name": "XIOM Omega IV Pro",
        "link": "https://www.megaspin.net/store/default.asp?pid=xiom-omega-iv-pro",
        "r_spin": "91",
        "r_speed": "90",
        "r_control": "71",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_xiom-omega-iv-pro.jpg?8",
        "r_description_1": "â¢ Extra playing properties by new carbo sponge and top layer\nâ¢ Additional clicking feel for sharper control\nâ¢ Extra spin with new chemical composition",
        "r_description_2": "Historical evolution towards full \"speed-glue\" aggression. Based on Hyper Elasto technology the new top sheet matched with upgraded Carbo Sponge offers extra-ordinary playing properties. Feel at the ball contact fully assimilate the clicking sensation generated by speed glues. New chemical composition and additional built-in tension make the ball more spinning and its trajectory significantly higher. OMEGA IV PRO stretches the ball from opponent's court very fiercely after the bounce as if launched from speed-glued rubber."
    },
    {
        "r_name": "XIOM Omega V Euro",
        "link": "https://www.megaspin.net/store/default.asp?pid=xiom-omega-v-euro",
        "r_spin": "97",
        "r_speed": "94",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_xiom-omega-v-euro.jpg?8",
        "r_description_1": "Xiom Omega V Euro, made with Dynamic Friction Technology is developed for the plastic ball.",
        "r_description_2": "Dynamic Friction rubber grabs the slippery plastic balls far more firm and solid at contact. \nControl of your ball with Dynamic Friction is simply beyond your expectation."
    },
    {
        "r_name": "XIOM Omega V Pro",
        "link": "https://www.megaspin.net/store/default.asp?pid=xiom-omega-v-pro",
        "r_spin": "96",
        "r_speed": "98",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_xiom-omega-v-pro.jpg?8",
        "r_description_1": "â¢ New power dynamics of professional swing speed\nâ¢ Energized ball flight and rebound\nâ¢ Extra precision for passive and offensive shots",
        "r_description_2": "Phased dynamics in the energy transfer between a ball and a rubber determines the rubber performance. Traditionally phased physical dynamics has been developed to produce the maximized spin and speed easily at lower swing speed. But the table tennis professionals can deliver solid contacts to the ball at higher swing speed. Their energy can be transferred more efficiently and precisely with the new dynamics, specially phased for the professional play. OMEGA V focused on the new dynamic mechanism for top professionals. Solid clicking, energy-charged repulse, and precise energy transfer allows the advantageous edge in small and big shots of the professional game. Experience the new dynamics and Win with us."
    },
    {
        "r_name": "XIOM Omega V Tour",
        "link": "https://www.megaspin.net/store/default.asp?pid=xiom-omega-v-tour",
        "r_spin": "98",
        "r_speed": "96",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_xiom-omega-v-tour.jpg?8",
        "r_description_1": "â¢ New power dynamics of professional swing speed\nâ¢ Energized ball flight and rebound\nâ¢ Extra precision for passive and offensive shots",
        "r_description_2": "Phased dynamics in the energy transfer between a ball and a rubber determines the rubber performance. Traditionally phased physical dynamics has been developed to produce the maximized spin and speed easily at lower swing speed. But the table tennis professionals can deliver solid contacts to the ball at higher swing speed. Their energy can be transferred more efficiently and precisely with the new dynamics, specially phased for the professional play. OMEGA V focused on the new dynamic mechanism for top professionals. Solid clicking, energy-charged repulse, and precise energy transfer allows the advantageous edge in small and big shots of the professional game. Experience the new dynamics and Win with us."
    },
    {
        "r_name": "XIOM Omega VII Asia",
        "link": "https://www.megaspin.net/store/default.asp?pid=xiom-omega-vii-asia",
        "r_spin": "96",
        "r_speed": "95",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_xiom-omega-vii-asia.jpg?8",
        "r_description_1": "Xiom Omega 7 Asia with Improved Connectivity\nFirm and solid grip for the plastic balls, improved spin dynamics.",
        "r_description_2": "ELASTO FUTURA generation with CYCLOID made a significant progress on the technical platform."
    },
    {
        "r_name": "XIOM Omega VII Euro",
        "link": "https://www.megaspin.net/store/default.asp?pid=xiom-omega-vii-euro",
        "r_spin": "98",
        "r_speed": "94",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_xiom-omega-vii-euro.jpg?8",
        "r_description_1": "FIRM AND SOLID GRIP ON PLASTIC BALL IMPROVED SPIN DYNAMICS WITH PLASTIC BALL",
        "r_description_2": "ELASTO FUTURA generation with CYCLOID made a significant progress on technical platform. DYNAMIC FRICTION has evolved to synchronize better with CARBO SPONGE and to give extremely powerful advantage for offensive play. New spin ratio per distance created the new equilibrium of speed & control. New generation has finally achieved True Professional Aggression."
    },
    {
        "r_name": "XIOM Omega VII Pro",
        "link": "https://www.megaspin.net/store/default.asp?pid=xiom-omega-vii-pro",
        "r_spin": "97",
        "r_speed": "96",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_xiom-omega-vii-pro.jpg?8",
        "r_description_1": "Firm and solid grip on plastic balls, improved spin and dynamics.",
        "r_description_2": "The plastic ball elasto futura generation withcycloid made a significant progress on a technical platform.\nDynamic Friction has evolved to synchronize better with Carbo Sponge and to give extremely powerful advantage for offensive play."
    },
    {
        "r_name": "XIOM Omega VII Tour",
        "link": "https://www.megaspin.net/store/default.asp?pid=xiom-omega-vii-tour",
        "r_spin": "98",
        "r_speed": "97",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_xiom-omega-vii-tour.jpg?8",
        "r_description_1": "The Xiom Omega VII Tour has improved connectivity, with firm and solid grip and improved spin dynamics with the poly ball.",
        "r_description_2": "ELASTO FUTURA generation with CYCLOID made significant progress on the technical platform. \nDYNAMIC FRICTION has evolved to synchronize better with CARBO SPONGE \nand to give extremely powerful advantage for offensive play. \nNew spin ratio per distance created the new equilibrium of speed & control. \nNew generation has finally achieved True Professional Aggression."
    },
    {
        "r_name": "XIOM Sigma II Euro",
        "link": "https://www.megaspin.net/store/default.asp?pid=xiom-sigma-ii-euro",
        "r_spin": "96",
        "r_speed": "93",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_xiom-sigma-ii-euro.jpg?8",
        "r_description_1": "SIGMA II EUROPE delivers the real results to the tour professionals. Tour professional version of Internal Mechanic Boost (IMB) makes you control the magnitude of spin energy easier and better. Developed by and made for tour professionals, SIGMA II EUROPE also shapes the ball trajectory easier than any other rubbers. Professional players know the well-controlled short balls and the accurate ball path increase the real winning probability. You can also charge far more energy on the spin with IMB technology. As a result, the ball winds up quicker and aggressively lower at the opponent's court while it can start comfortably higher. Dynamics of the black CARBO sponge also boost this energy mechanism to create the real advantages for tour professionals. Raise your standard and Win with us.",
        "r_description_2": "Strategy: Mix\nDistance from Table: Close to Mid\nSpeed: 93\nSpin: 96\nControl: 67\nHardness: Medium"
    },
    {
        "r_name": "XIOM Vega Europe",
        "link": "https://www.megaspin.net/store/default.asp?pid=xiom-vega-europe",
        "r_spin": "91",
        "r_speed": "85",
        "r_control": "73",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_xiom-vega-europe.jpg?8",
        "r_description_1": "Introduced Jan 2009",
        "r_description_2": "Spin is the most important element of modern table tennis. Not only the strength of spin but also the stability and secure feel have been desired by many players. VEGA series is the realization of the dream. VEGA is the mixture of two new technologies - HYPER ELASTO and CARBO SPONGE. Both of them are based on TENSOR technology which gives rubber the effect of built-in tension. HYPER ELASTO provides extreme spin and stability, and black colored CARBO SPONGE provides innovative efficiency of energy. Further, the feel of VEGA is exciting but comfortable. Its ease of use will help players play âwinningâ table tennis. Now four variations are available. All of them provide exceptional spin capability. VEGA PRO is for extreme spin, softer VEGA ASIA is for more speed, VEGA EUROPE is softer with more control, and finally, the softest VEGA ELITE is for extreme control."
    },
    {
        "r_name": "XIOM Vega Pro",
        "link": "https://www.megaspin.net/store/default.asp?pid=xiom-vega-pro",
        "r_spin": "89",
        "r_speed": "87",
        "r_control": "73",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_xiom-vega-pro.jpg?8",
        "r_description_1": "Spin is the most important element of modern table tennis. Not only the strength of spin but also the stability and secure feel have been desired by many players. VEGA series is the realization of the dream. VEGA is the mixture of two new technologies - HYPER ELASTO and CARBO SPONGE. Both of them are based on TENSOR technology which gives rubber the effect of built-in tension. HYPER ELASTO provides extreme spin and stability, and black colored CARBO SPONGE provides innovative efficiency of energy. Further, the feel of VEGA is exciting but comfortable. Its ease of use will help players play âwinningâ table tennis. Now four variations are available. All of them provide exceptional spin capability. VEGA PRO is for extreme spin, softer VEGA ASIA is for more speed, VEGA EUROPE is softer with more control, and finally, the softest VEGA ELITE is for extreme control.",
        "r_description_2": "Strategy: Mix\nDistance from table: Close to Mid\nSpeed: 87\nSpin: 89\nControl: 73\nHardness: Medium-Hard"
    },
    {
        "r_name": "Yasaka A1 Pips out",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-a1-2",
        "r_spin": "46",
        "r_speed": "58",
        "r_control": "92",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "YASAKA A-1 HARD BAT RUBBER\nShort pips and no sponge but it has a fiber backing for easy glue application. Used mostly by our US classic hardbat players and \ndefensive players. Works well with \ndefensive blades like Yasaka Sweeper or Donic Defplay Senso-3.",
        "r_description_2": "Speed:58\nSpin: 46\nControl: 92"
    },
    {
        "r_name": "Yasaka Anti-Power",
        "link": "https://www.megaspin.net/store/default.asp?pid=yas-antipwr",
        "r_spin": "28",
        "r_speed": "62",
        "r_control": "73",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "Anti-Power is capable of killing any kind of speed and spin. Another feature is the peculiar sound when applying your offensive shots. Any combination of the Anti Power rubber with either the Mark V, Tornado or Extreme will most certainly make you a varied and dangerous defensive or offensive player.",
        "r_description_2": "Speed 62\nSpin 28\nControl 73"
    },
    {
        "r_name": "Yasaka Cobalt Pips Out",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-cobalt",
        "r_spin": "59",
        "r_speed": "68",
        "r_control": "85",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "Cobalt rubber, another choice for our American hard bat fighters. It is an all rubber product, no fiber backing, thick enough that it will not curl when glue is applied. Very fast, for the offensive minded!",
        "r_description_2": "Speed: 68  \nSpin: 59  \nControl: 85"
    },
    {
        "r_name": "Yasaka Fusion",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-fusion",
        "r_spin": "91",
        "r_speed": "94",
        "r_control": "77",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "In Yasaka Fusion three different synthetic rubbers are mixed with natural rubber for the outside rubber.\nEach three kinds have individual characteristics for : Speed, Spin and Durability\nThat is the basic technology for Yasaka's new concept \"Energy Fusion Rubber\".\nThe sponge fusion also contains a certain level of synthetic rubber, which support a good speed glue effect. \nWhen using Fusion with speed glue you will feel a very elastic and easy playing rubber with a strong sound effect!\nSponge hardness: 38 degrees",
        "r_description_2": "Speed: 94\nSpin: 91\nControl: 77"
    },
    {
        "r_name": "Yasaka Mark V",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-markv",
        "r_spin": "90",
        "r_speed": "90",
        "r_control": "78",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-markv.jpg?8",
        "r_description_1": "Was one of the first rubber blending natural and synthetic rubbers. It is more than 2 decades that this rubber has been a strong weapon in world class championship play with its dynamic speed and spin.",
        "r_description_2": "Speed: 90 \nSpin: 90 \nControl: 78"
    },
    {
        "r_name": "Yasaka Mark V 30",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-markv-30",
        "r_spin": "91",
        "r_speed": "92",
        "r_control": "77",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-markv-30.jpg?8",
        "r_description_1": "The all new Mark V 30 the speed glue version with a softer 30 sponge.",
        "r_description_2": "We managed to double speed glue absorption and improve spring capacity. Improved spin by maintaining the sponge hardness levels at 30 degrees. The excellent balance between speed and spin promises new excitement for the table tennis game!"
    },
    {
        "r_name": "Yasaka Mark V HPS",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-mark-v-hps",
        "r_spin": "100",
        "r_speed": "100",
        "r_control": "60",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-mark-v-hps.jpg?8",
        "r_description_1": "Mark V HPS",
        "r_description_2": "MARK V HPS is a top of the range fast table tennis rubber and gives you all the characteristics required for advanced offensive play. \nMARK V HPS is the result of the newest Japanese rubber technology."
    },
    {
        "r_name": "Yasaka Mark V HPS Soft",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-mark-v-hps-soft",
        "r_spin": "100",
        "r_speed": "98",
        "r_control": "65",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-mark-v-hps-soft.jpg?8",
        "r_description_1": "Mark V HPS SOFT",
        "r_description_2": "Yasakaâs rubber technicians have been at the forefront of taking the âthe big stepsâ in the development of table tennis rubbers. When the ITTF banned the use of speed glue and also the use of booster Yasaka started intensive development work."
    },
    {
        "r_name": "Yasaka Mark V M2",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-markv-m2",
        "r_spin": "91",
        "r_speed": "92",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-markv-m2.jpg?8",
        "r_description_1": "Highest possible speed. The M2 is the most recent addition to the Mark V program. It started from the basis of the unbeatable characteristics of the Mark V but aimed to design a weapon with sharp spin and highest possible speed for the top players.",
        "r_description_2": "Speed: 92 \nSpin: 91 \nControl: 80"
    },
    {
        "r_name": "Yasaka Mark V XS",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-mark-vxs",
        "r_spin": "91",
        "r_speed": "94",
        "r_control": "81",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "The Mark V \"family\" of rubber sheets are the most famous among the top players all over the World. The aim was, when developing MARK V XS to offer a rubber with superior spin characteristics without losing too much speed. The way the Yasaka technicians achieved this is: - the balance or raw material for the top sheet was changed - some new chemicals where added - the production process is improved The result is D.A.T., D ouble A cceleration T echnology, which gives the rubber extremely strong spin possibilities and good speed.",
        "r_description_2": "Speed: 94\nSpin: 91\nControl: 81"
    },
    {
        "r_name": "Yasaka New Era",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-new-era",
        "r_spin": "96",
        "r_speed": "92",
        "r_control": "72",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "",
        "r_description_2": "With NEW ERA there are new possibilities for the offensive table tennis player, who wants to make counter attacks. With a new technology to combine the sponge and top sheet, High Tension technology, NEW ERA is very much suitable for top spin attacks against the opponents top spin."
    },
    {
        "r_name": "Yasaka Original",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-orig",
        "r_spin": "72",
        "r_speed": "72",
        "r_control": "88",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "Yasaka Original",
        "r_description_2": "The soft allround control rubber which was one of the first soft rubber since 1953. It started the soft rubber revolution in table tennis. The most reliable and finest quality in its class."
    },
    {
        "r_name": "Yasaka Original Extra XHG",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-orig-extra",
        "r_spin": "78",
        "r_speed": "79",
        "r_control": "83",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "Original XHG",
        "r_description_2": "ORIGINAL EXTRA HG is suitable for modern methods of playing, enabling players to vary their attack and defence as required with a great variety of spin and power. ORIGINAL XHG offers a very good value for the money."
    },
    {
        "r_name": "Yasaka Phantom 0011 Infinity",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-phantom-0011",
        "r_spin": "43",
        "r_speed": "43",
        "r_control": "58",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "PHANTOM 0011 \nMore of Phantom phenomena based on our preceding Yasaka Phantom series rubber. The all new and legal 0011 and 0012 assure you of further improvement in spin and speed. Also, more variation, better control, stable attack \npower and more knuckle ball effect.",
        "r_description_2": "Speed 43        \nSpin 43       \nControl 58"
    },
    {
        "r_name": "Yasaka Phantom 0012 Infinity",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-phantom-0012",
        "r_spin": "43",
        "r_speed": "40",
        "r_control": "51",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "PHANTOM AND 0012 no sponge\nMore of Phantom phenomena based on our preceding Yasaka Phantom series rubber. The all new and legal 0011 and 0012 assure you of further improvement in spin and speed. Also, more variation, better control, stable attack \npower and more knuckle ball effect.",
        "r_description_2": "Speed 40        \nSpin 43       \nControl 51"
    },
    {
        "r_name": "Yasaka Pryde",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-pryde",
        "r_spin": "95",
        "r_speed": "99",
        "r_control": "72",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-pryde.jpg?8",
        "r_description_1": "With PRYDE Yasaka introduces the first POWER TENSION rubber. \nThe all New PRYDE offers a quick ball bounce, nice sound and a rubber surface with improved friction.",
        "r_description_2": "PRYDE is suitable for advanced players."
    },
    {
        "r_name": "Yasaka Pryde 30",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-pryde-30",
        "r_spin": "95",
        "r_speed": "92",
        "r_control": "71",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-pryde-30.jpg?8",
        "r_description_1": "PRYDE 30",
        "r_description_2": "With PRYDE Yasaka introduces the first POWER TENSION rubber.\nPRYDE 30 is a softer version of the PRYDE rubber."
    },
    {
        "r_name": "Yasaka Rakza 7",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-rakza-7",
        "r_spin": "95",
        "r_speed": "94",
        "r_control": "67",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-rakza-7.jpg?8",
        "r_description_1": "Yasaka, uses mainly natural rubber for the top sheet. This improves the level of grip and the power of spin drastically. The top sheet is combined with the new Power Sponge. The top sheet and Power Sponge work in perfect synergy, producing the Hybrid Energy rubber Rakza 7. When the player hits the ball hard, the rubber grips the ball and the stroke can be used to place the ball accurately, both in direction and length. The serve and short returns are very sharp and easy to handle. Due to the increased percentage of natural gum the durability is improved. A winning combination!",
        "r_description_2": "Speed: 94   \nControl: 67   \nSpin: 95  \nHardness: 45-50"
    },
    {
        "r_name": "Yasaka Rakza 7 Soft",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-rakza-7-soft",
        "r_spin": "96",
        "r_speed": "93",
        "r_control": "68",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-rakza-7-soft.jpg?8",
        "r_description_1": "In Rakza 7 Soft the top sheet is the same as for Rakza 7. The sponge is softer which gives the rubber more sound and built-in speed glue effect. With Rakza 7 Soft the control characteristics are improved. After hitting the ball with top spin the curve of the ball is slightly higher, giving little bit bigger margins in the game. In the short return play, the ball feel is better.",
        "r_description_2": "Speed: 93   \nSpin: 96   \nControl: 68 \nHardness: 37- 42"
    },
    {
        "r_name": "Yasaka Rakza 9",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-rakza-9",
        "r_spin": "105",
        "r_speed": "102",
        "r_control": "60",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-rakza-9.jpg?8",
        "r_description_1": "The first rubber to be introduced with Yasakaâs Hybrid Energy system was the Rakza 7, which is highly valued by high class players all over the world. The latest addition to the Rakza family is Rakza 9, which has improved speed characteristics. The surface rubber of Rakza 9 has a newly developed formula/rubber combination. In addition the new sponge is made of a more homogenous material and has larger pores. Rakza 9 is the fastest of Yasakaâs Hybrid Energy rubbers and is suitable for technical offensive players, using both high speed and spin to win the point.",
        "r_description_2": "Speed: 102 \nControl: 60 \nSpin: 105"
    },
    {
        "r_name": "Yasaka Rakza PO",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-rakza-po",
        "r_spin": "70",
        "r_speed": "93",
        "r_control": "78",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-rakza-po.jpg?8",
        "r_description_1": "",
        "r_description_2": "Yasaka Rakza PO short pips-out, is one of several rubbers with the newly developed top sheet using mainly natural rubber gum. This improves the level of grip and the power of spin drastically. The top sheet is combined with the new âPower Spongeâ. The top sheet and âPower Spongeâ work in perfect synergy, producing the Hybrid Energy rubber. With Rakza PO Yasaka developed a short pimples-out rubber with increased spin capacity, due to the shape of the pimples geometry and the use of more natural gum in the top sheet."
    },
    {
        "r_name": "Yasaka Rakza X",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-rakza-x",
        "r_spin": "95",
        "r_speed": "94",
        "r_control": "71",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-rakza-x.jpg?8",
        "r_description_1": "The new Rakza X is the latest addition to the popular and highly successful Rakza series of Yasaka rubbers. The top sheet is made of natural rubber, employing a new production method.",
        "r_description_2": "The result is a top surface with exceptional grip enabling both phenomenal spin and speed. These qualities reduce the margin for error. This top sheet is then combined with a harder Power Sponge. The resulting combination of a faster sponge and high grip top sheet enables you to place the ball accurately with a high degree of success."
    },
    {
        "r_name": "Yasaka Rakza X Soft",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-rakza-x-soft",
        "r_spin": "96",
        "r_speed": "93",
        "r_control": "71",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-rakza-x-soft.jpg?8",
        "r_description_1": "RAKZA X is the first rubber with NSS (New Surface System), Yasakaâs new production process to improve the grip of the rubber surface. NSS gives a stronger touch when hitting the ball, and the control in both attack and blocking is improved.\nIn RAKZA X Soft the same surface rubber is working together with a relatively soft sponge, Feel Sponge, with good catapult effect. The combination of the elastic sponge and high grip top sheet increase the the feeling and improves the control of your game.",
        "r_description_2": "Speed: 93\t\nSpin: 96\t\nControl: 71"
    },
    {
        "r_name": "Yasaka Rigan",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-rigan",
        "r_spin": "99",
        "r_speed": "98",
        "r_control": "66",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-rigan.jpg?8",
        "r_description_1": "Yasaka RIGAN is a newly developed table tennis rubber from Yasaka. \nWhen the Rigan rubber was developed the goal was \nto combine the advantages of \"classical\" rubbers and \"modern technology\" rubbers. \nWith Rigan you get a perfect ball control and a dynamic speed characteristics, \nresulting in a rubber that is very easy to handle. \nRigan has a high durability and offers good value for the money.",
        "r_description_2": "Speed: 98 \nSpin: 99 \nControl: 66"
    },
    {
        "r_name": "Yasaka Rising Dragon",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-rising-dragon",
        "r_spin": "98",
        "r_speed": "92",
        "r_control": "97",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-rising-dragon.jpg?8",
        "r_description_1": "With the new rubber RISING DRAGON Yasaka has successfully combined not only the advantages of the chinese sticky surface but also the renown qualities of speed and touch from japanese rubber technology.\nRISING DRAGON offers a new dimension to your game as it is easy to make both sharp chop returns and power drives with good control.",
        "r_description_2": "Speed: 92\t\nSpin: 98\t\nControl: 97"
    },
    {
        "r_name": "Yasaka Shining Dragon",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-shining-dragon",
        "r_spin": "93",
        "r_speed": "89",
        "r_control": "95",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-shining-dragon.jpg?8",
        "r_description_1": "Yasaka can offer a table tennis rubber with a very sticky top sheet combined with a rather hard sponge. \nThe sticky rubber makes it easy to control the topspin, serves and short cut returns. \nThe tension of the sponge creates outstanding speed.",
        "r_description_2": "Even though being a sticky Chinese rubber SHINING DRAGON is light-weighted."
    },
    {
        "r_name": "Yasaka Valmo",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-valmo",
        "r_spin": "90",
        "r_speed": "99",
        "r_control": "86",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-valmo.jpg?8",
        "r_description_1": "Yasaka rubber VALMO, made in Japan using the latest Japanese technology, called \"JP HYBRID\".",
        "r_description_2": "The top sheet has a large proportion of natural gum, which produces strong grip power and heavy spin. \nVALMO has a maximum tension sponge which gives fast acceleration of the ball but also offers precision at high speeds with the grippy top sheet."
    },
    {
        "r_name": "Yasaka X-Tend HS",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-x-tend-hs",
        "r_spin": "98",
        "r_speed": "92",
        "r_control": "76",
        "thumbnail": "https://www.megaspin.net/store/comparerubber.asp?brand_filter=",
        "r_description_1": "Powerful New Generation of STS developed to comply with new Speed glue rules.",
        "r_description_2": "STS is well known for giving 2/3 of tension energy to spin and 1/3 to speed."
    },
    {
        "r_name": "Yasaka X-Tend SD",
        "link": "https://www.megaspin.net/store/default.asp?pid=y-x-tend-sd",
        "r_spin": "120",
        "r_speed": "110",
        "r_control": "80",
        "thumbnail": "https://www.megaspin.net/store/images/products/zoom_y-x-tend-sd.jpg?8",
        "r_description_1": "The Spin Tension System (STS),which was adopted by the very popular XTEND rubber series, gives 2/3 of the tension energy to spin and 1/3 to speed. XTEND SD uses the same system, but it has now been re-designed and updated to deliver even greater stability. Yasaka have reformulated the top sheet,enabling the durability to be greatly improved. The sponge has also been re-designed to incorporate the much valued qualities of easy handling and enjoyable sound.",
        "r_description_2": "Experience the hitting sound, penetrating speed and the new sense of play,  easier to use masterpiece \"Xtend SD"
    }
]
